[
	{
		"date": "January 27 BC",
		"name": "Augustus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Statue-Augustus.jpg/220px-Statue-Augustus.jpg",
		"history": "Augustus (Latin: Imperator Caesar Divi filius Augustus;[nb 1] 23 September 63 BC – 19 August AD 14) was a Roman statesman and military leader who was the first emperor of the Roman Empire, reigning from 27 BC until his death in AD 14.[nb 2] His status as the founder of the Roman Principate has consolidated an enduring legacy as one of the most effective and controversial leaders in human history.[1][2] The reign of Augustus initiated an era of relative peace known as the Pax Romana. The Roman world was largely free from large-scale conflict for more than two centuries, despite continuous wars of imperial expansion on the Empire's frontiers and the year-long civil war known as the \"Year of the Four Emperors\" over the imperial succession.\nAugustus was born Gaius Octavius Thurinus into an old and wealthy equestrian branch of the plebeian gens Octavia. His maternal great-uncle Julius Caesar was assassinated in 44 BC, and Octavius was named in Caesar's will as his adopted son and heir. Along with Mark Antony and Marcus Lepidus, he formed the Second Triumvirate to defeat the assassins of Caesar. Following their victory at the Battle of Philippi, the Triumvirate divided the Roman Republic among themselves and ruled as military dictators. The Triumvirate was eventually torn apart by the competing ambitions of its members. Lepidus was driven into exile and stripped of his position, and Antony committed suicide following his defeat at the Battle of Actium by Octavian in 31 BC.\nAfter the demise of the Second Triumvirate, Augustus restored the outward façade of the free Republic, with governmental power vested in the Roman Senate, the executive magistrates, and the legislative assemblies. In reality, however, he retained his autocratic power over the Republic as a military dictator. By law, Augustus held a collection of powers granted to him for life by the Senate, including supreme military command, and those of tribune and censor. It took several years for Augustus to develop the framework within which a formally republican state could be led under his sole rule. He rejected monarchical titles, and instead called himself Princeps Civitatis (\"First Citizen of the State\"). The resulting constitutional framework became known as the Principate, the first phase of the Roman Empire.\nAugustus dramatically enlarged the Empire, annexing Egypt, Dalmatia, Pannonia, Noricum, and Raetia, expanding possessions in Africa, and completing the conquest of Hispania, but suffered a major setback in Germania. Beyond the frontiers, he secured the Empire with a buffer region of client states and made peace with the Parthian Empire through diplomacy. He reformed the Roman system of taxation, developed networks of roads with an official courier system, established a standing army, established the Praetorian Guard, created official police and fire-fighting services for Rome, and rebuilt much of the city during his reign. Augustus died in AD 14 at the age of 75, probably from natural causes. However, there were unconfirmed rumors that his wife Livia poisoned him. He was succeeded as emperor by his adopted son (also stepson and former son-in-law) Tiberius.\n"
	},
	{
		"date": "September 14",
		"name": "Tiberius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Tiberius%2C_Romisch-Germanisches_Museum%2C_Cologne_%288115606671%29.jpg/220px-Tiberius%2C_Romisch-Germanisches_Museum%2C_Cologne_%288115606671%29.jpg",
		"history": "Tiberius (/taɪˈbɪəriəs/; Latin: Tiberius Caesar Divi Augusti filius Augustus;[1][2] 16 November 42 BC – 16 March 37 AD) was the second Roman emperor, reigning from 14 AD to 37 AD, succeeding Augustus. \nBorn to Tiberius Claudius Nero and Livia Drusilla in a Claudian family, he was given the personal name Tiberius Claudius Nero. His mother divorced Nero and married Octavian—later to ascend to Emperor as Augustus—who officially became his stepfather. Tiberius would later marry Augustus' daughter (from his marriage to Scribonia), Julia the Elder, and even later be adopted by Augustus. Through the adoption, he officially became a Julian, assuming the name Tiberius Julius Caesar. The emperors after Tiberius would continue this blended dynasty of both families for the following thirty years; historians have named it the Julio-Claudian dynasty. His relationship to the other emperors of this dynasty was as follows: he was the stepson of Augustus, grand-uncle of Caligula, paternal uncle of Claudius, and great-grand uncle of Nero. Tiberius' 22-and-a-half-year reign would be the longest after that of Augustus until that of Antoninus Pius, who surpassed his reign by a few months.\nTiberius was one of the greatest Roman generals; his conquest of Pannonia, Dalmatia, Raetia, and (temporarily) parts of Germania, laid the foundations for the northern frontier. Even so, he came to be remembered as a dark, reclusive and sombre ruler who never really desired to be emperor; Pliny the Elder called him \"the gloomiest of men\".[3] After the death of his son Drusus Julius Caesar in 23 AD, Tiberius became more reclusive and aloof. In 26 AD he removed himself from Rome and left administration largely in the hands of his unscrupulous Praetorian prefects Lucius Aelius Sejanus and Quintus Naevius Sutorius Macro. When Tiberius died, he was succeeded by his grand-nephew and adopted grandson, Caligula.[4]"
	},
	{
		"date": "July 21",
		"name": "Maximian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/c9/MSR_-_T%C3%AAte_de_l%27empreur_Maximien_Hercule_-_Inv_34_b_%28cropped%29.jpg/220px-MSR_-_T%C3%AAte_de_l%27empreur_Maximien_Hercule_-_Inv_34_b_%28cropped%29.jpg",
		"history": "Maximian (Latin: Marcus Aurelius Valerius Maximianus Herculius Augustus;[9] c. 250 – c. July 310) was Roman Emperor from 286 to 305. He was Caesar[1][2] from 285 to 286, then Augustus from 286[3] to 305.[4] He shared the latter title with his co-emperor and superior, Diocletian, whose political brain complemented Maximian's military brawn. Maximian established his residence at Trier but spent most of his time on campaign. In late 285, he suppressed rebels in Gaul known as the Bagaudae. From 285 to 288, he fought against Germanic tribes along the Rhine frontier. Together with Diocletian, he launched a scorched earth campaign deep into Alamannic territory in 288, temporarily relieving the Rhine provinces from the threat of Germanic invasion.\nThe man he appointed to police the Channel shores, Carausius, rebelled in 286, causing the secession of Britain and northwestern Gaul. Maximian failed to oust Carausius, and his invasion fleet was destroyed by storms in 289 or 290. Maximian's subordinate, Constantius, campaigned against Carausius' successor, Allectus, while Maximian held the Rhine frontier. The rebel leader was ousted in 296, and Maximian moved south to combat piracy near Hispania and Berber incursions in Mauretania. When these campaigns concluded in 298, he departed for Italy, where he lived in comfort until 305. At Diocletian's behest, Maximian abdicated on May 1, 305, gave the Augustan office to Constantius, and retired to southern Italy.\nIn late 306, Maximian took the title of Augustus again and aided his son Maxentius' rebellion in Italy. In April 307, he attempted to depose his son, but failed and fled to the court of Constantius' successor, Constantine (Maximian's step-grandson and son-in-law), in Trier. At the Council of Carnuntum in November 308, Diocletian and his successor, Galerius, forced Maximian to renounce his imperial claim again. In early 310, Maximian attempted to seize Constantine's title while the emperor was on campaign on the Rhine. Few supported him, and he was captured by Constantine in Marseille. Maximian killed himself in mid-310 on Constantine's orders. During Constantine's war with Maxentius, Maximian's image was purged from all public places. However, after Constantine ousted and killed Maxentius, Maximian's image was rehabilitated, and he was deified.\n"
	},
	{
		"date": "March 37",
		"name": "Caligula",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/3/35/Gaius_Caesar_Caligula.jpg/220px-Gaius_Caesar_Caligula.jpg",
		"history": "Caligula (/kəˈlɪɡjʊlə/;[1] Latin: Gaius Julius Caesar Augustus Germanicus; 31 August 12 – 24 January 41 AD) was Roman emperor from 37 to 41 AD. The son of the popular Roman general Germanicus and Augustus's granddaughter Agrippina the Elder, Caligula was born into the first ruling family of the Roman Empire, conventionally known as the Julio-Claudian dynasty. Germanicus's uncle and adoptive father, Tiberius, succeeded Augustus as emperor of Rome in 14.\nAlthough he was born Gaius Caesar, after Julius Caesar, he acquired the nickname \"Caligula\" (meaning \"little [soldier's] boot\", the diminutive form of caliga) from his father's soldiers during their campaign in Germania. When Germanicus died at Antioch in 19, Agrippina returned with her six children to Rome, where she became entangled in a bitter feud with Tiberius. The conflict eventually led to the destruction of her family, with Caligula as the sole male survivor. Untouched by the deadly intrigues, Caligula accepted an invitation in 31 to join the emperor on the island of Capri, where Tiberius had withdrawn five years earlier. Following the death of Tiberius, Caligula succeeded his adoptive grandfather as emperor in 37.\nThere are few surviving sources about the reign of Caligula, although he is described as a noble and moderate emperor during the first six months of his rule. After this, the sources focus upon his cruelty, sadism, extravagance, and sexual perversion, presenting him as an insane tyrant. While the reliability of these sources is questionable, it is known that during his brief reign, Caligula worked to increase the unconstrained personal power of the emperor, as opposed to countervailing powers within the principate. He directed much of his attention to ambitious construction projects and luxurious dwellings for himself, and initiated the construction of two aqueducts in Rome: the Aqua Claudia and the Anio Novus. During his reign, the empire annexed the client kingdom of Mauretania as a province.\nIn early 41, Caligula was assassinated as a result of a conspiracy by officers of the Praetorian Guard, senators, and courtiers. The conspirators' attempt to use the opportunity to restore the Roman Republic was thwarted, however. On the day of the assassination of Caligula, the Praetorians declared Caligula's uncle, Claudius, the next Roman emperor. Although the Julio-Claudian dynasty continued to rule the empire until the fall of his nephew Nero in 68, Caligula's death marked the official end of the Julii Caesares in the male line.\n"
	},
	{
		"date": "January 41",
		"name": "Claudius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/7/71/Claudius_crop.jpg/220px-Claudius_crop.jpg",
		"history": "Claudius (/ˈklɔːdiəs/; Latin: Tiberius Claudius Caesar Augustus Germanicus;[a][b] 1 August 10 BC – 13 October AD 54) was Roman emperor from AD 41 to 54. Born to Drusus and Antonia Minor at Lugdunum in Roman Gaul, where his father was stationed as a military legate, he was the first Roman emperor to be born outside Italy. Nonetheless, Claudius was an Italic of Sabine origins and a member of the Julio-Claudian dynasty.[1] Because he was afflicted with a limp and slight deafness due to sickness at a young age, his family ostracized him and excluded him from public office until his consulship, shared with his nephew Caligula in 37.\nClaudius's infirmity probably saved him from the fate of many other nobles during the purges of Tiberius's and Caligula's reigns; potential enemies did not see him as a serious threat. His survival led to his being declared emperor by the Praetorian Guard after Caligula's assassination, at which point he was the last man of his family. Despite his lack of experience, Claudius proved to be an able and efficient administrator. He was also an ambitious builder, constructing many new roads, aqueducts, and canals across the Empire. During his reign the Empire started its successful conquest of Britain.\nHaving a personal interest in law, he presided at public trials, and issued up to twenty edicts a day. He was seen as vulnerable throughout his reign, particularly by elements of the nobility. Claudius was constantly forced to shore up his position; this resulted in the deaths of many senators. These events damaged his reputation among the ancient writers, though more recent historians have revised this opinion. Many authors contend that he was murdered by his own wife.  After his death in 54 (at the age of 63), his grand-nephew, step-son, and adopted son Nero succeeded him as emperor. His 13-year reign (slightly longer than Nero's) would not be surpassed by any successors until that of Domitian, who reigned for 15 years.\nHe was a descendant of the Octavii Rufi (through Gaius Octavius), Julii Caesares (through Julia Minor and Julia Antonia), and the Claudii Nerones (through Nero Claudius Drusus). He was a step-grandson (through his father Drusus) and great-nephew (through his mother Antonia Minor) of Augustus. He was a nephew of Tiberius through his father, Tiberius's brother. Through his brother Germanicus, Claudius was an uncle of Caligula and a great uncle of Nero. Through his mother Antonia Minor he was a grandson of Mark Antony.\n"
	},
	{
		"date": "October 54",
		"name": "Nero",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/89/Nero_1.JPG/220px-Nero_1.JPG",
		"history": "Nero (/ˈnɪəroʊ/; Latin: Nero Claudius Caesar Augustus Germanicus;[i] 15 December 37 – 9 June 68 AD) was the last Roman emperor of the Julio-Claudian dynasty.[1][2] He was adopted by his great-uncle Claudius and became Claudius' heir and successor.[1] Like Claudius, Nero became emperor with the consent of the Praetorian Guard. Nero's mother, Agrippina the Younger, was likely implicated in Claudius' death and Nero's nomination as emperor. She dominated Nero's early life and decisions until he cast her off. Five years into his reign, he had her murdered.[1]During the early years of his reign, Nero was content to be guided by his mother, his tutor Lucius Annaeus Seneca, and his Praetorian prefect Sextus Afranius Burrus. As time passed, he started to play a more active and independent role in government and foreign policy. During his reign, the redoubtable general Corbulo conducted a successful war and negotiated peace with the Parthian Empire. His general Suetonius Paulinus crushed a major revolt in Britain, led by the Iceni Queen Boudica. The Bosporan Kingdom was briefly annexed to the empire, and the First Jewish–Roman War began.[3] Nero focused much of his attention on diplomacy, trade and the cultural life of the empire, ordering theatres built and promoting athletic games. He made public appearances as an actor, poet, musician and charioteer. In the eyes of traditionalists, this undermined the dignity and authority of his person, status, and office. His extravagant, empire-wide program of public and private works was funded by a rise in taxes that was much resented by the upper classes. In contrast, his populist style of rule remained very popular among the lower classes of Rome and the provinces until his death and beyond. Various plots against his life were revealed; the ringleaders, most of them Nero's own courtiers, were executed.\nIn 68 AD Vindex, governor of the Gaulish territory Gallia Lugdunensis, rebelled. He was supported by Galba, the governor of Hispania Tarraconensis. Vindex's revolt failed in its immediate aim, but Nero fled Rome when Rome's discontented civil and military authorities chose Galba as emperor. He committed suicide on June 9, 68 AD, when he learned that he had been tried in absentia and condemned to death as a public enemy, making him the first Roman Emperor to commit suicide.[4][5] His death ended the Julio-Claudian dynasty, sparking a brief period of civil wars known as the Year of the Four Emperors.\nNero's rule is usually associated with tyranny and extravagance.[6][7] Most Roman sources, such as Suetonius and Cassius Dio, offer overwhelmingly negative assessments of his personality and reign; Tacitus claims that the Roman people thought him compulsive and corrupt. Suetonius tells that many Romans believed that the Great Fire of Rome was instigated by Nero to clear the way for his planned palatial complex, the Domus Aurea.[8] According to Tacitus he was said to have seized Christians as scapegoats for the fire and burned them alive, seemingly motivated not by public justice but by personal cruelty.[9] Some modern historians question the reliability of the ancient sources on Nero's tyrannical acts.[10] A few sources paint Nero in a more favorable light. There is evidence of his popularity among the Roman commoners, especially in the eastern provinces of the Empire, where a popular legend arose that Nero had not died and would return. At least three leaders of short-lived, failed rebellions presented themselves as \"Nero reborn\" to enlist popular support.\n"
	},
	{
		"date": "June 68",
		"name": "Galba",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/7/70/Stockholm_-_Antikengalerie_4_-_B%C3%BCste_Kaiser_Galba.jpg/220px-Stockholm_-_Antikengalerie_4_-_B%C3%BCste_Kaiser_Galba.jpg",
		"history": "Servius Sulpicius Galba (/ˈsɜːrviəs sʌlˈpɪʃəs ˈɡælbə/; Latin: Servius Sulpicius Galba Caesar Augustus;[note 2] 24 December 3 BC – 15 January AD 69) was Roman emperor from 68 to 69, the first emperor in the Year of the Four Emperors. He was known as Lucius Livius Galba Ocella[note 3] prior to taking the throne as a result of his adoption by his stepmother, Livia Ocellina. The governor of Hispania at the time of the rebellion of Gaius Julius Vindex in Gaul, he seized the throne following Nero's suicide.\nBorn into a wealthy family, Galba held at various times the offices of praetor, consul, and governor of the provinces Aquitania, Upper Germany, and Africa during the first half of the first century AD. He retired during the latter part of Claudius' reign but Nero later granted him the governorship of Hispania. Taking advantage of the defeat of Vindex's rebellion and Nero's suicide, he became emperor with the support of the Praetorian Guard. His physical weakness and general apathy led to his being dominated by favorites. Unable to gain popularity with the people or maintain the support of the Praetorian Guard, Galba was murdered by Otho, who then became emperor.\n"
	},
	{
		"date": "January 69",
		"name": "Otho",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/81/Otone_-_foto_di_euthman.jpg/220px-Otone_-_foto_di_euthman.jpg",
		"history": "Otho (/ˈoʊθoʊ/; Latin: Marcus Salvius Otho Caesar Augustus;[2][3] 28 April 32 – 16 April 69) was Roman emperor for three months, from 15 January to 16 April 69. He was the second emperor of the Year of the Four Emperors.\nA member of a noble Etruscan family, Otho was initially a friend and courtier of the young emperor Nero until he was effectively banished to the governorship of the remote province of Lusitania in 58 following his wife Poppaea Sabina's affair with Nero. After a period of moderate rule in the province, he allied himself with Galba, the governor of neighbouring Hispania Tarraconensis, during the revolts of 68. He accompanied Galba on his march to Rome, but revolted and murdered Galba at the start of the next year.\nInheriting the problem of the rebellion of Vitellius, commander of the army in Germania Inferior, Otho led a sizeable force which met Vitellius' army at the Battle of Bedriacum. After initial fighting resulted in 40,000 casualties, and a retreat of his forces, Otho committed suicide rather than fight on and Vitellius was proclaimed emperor.\n"
	},
	{
		"date": "April 69",
		"name": "Vitellius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Pseudo-Vitellius_Louvre_MR684.jpg/220px-Pseudo-Vitellius_Louvre_MR684.jpg",
		"history": "Vitellius (/vɪˈtɛliəs/; Latin: Aulus Vitellius Germanicus Augustus;[1] 24 September 15 – 22 December 69 AD) was Roman Emperor for eight months, from 16 April to 22 December 69 AD. Vitellius was proclaimed emperor following the quick succession of the previous emperors Galba and Otho, in a year of civil war known as the Year of the Four Emperors. Vitellius was the first to add the honorific cognomen Germanicus to his name instead of Caesar upon his accession. Like his direct predecessor, Otho, Vitellius attempted to rally public support to his cause by honoring and imitating Nero who remained widely popular in the empire.\nHis claim to the throne was soon challenged by legions stationed in the eastern provinces, who proclaimed their commander Vespasian emperor instead. War ensued, leading to a crushing defeat for Vitellius at the Second Battle of Bedriacum in northern Italy. Once he realised his support was wavering, Vitellius prepared to abdicate in favor of Vespasian. He was not allowed to do so by his supporters, resulting in a brutal battle for Rome between Vitellius' forces and the armies of Vespasian. He was eventually executed in Rome by Vespasian's soldiers on 22 December 69.\n"
	},
	{
		"date": "July 69",
		"name": "Vespasian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/6/64/Vespasianus01_pushkin_edit.png/220px-Vespasianus01_pushkin_edit.png",
		"history": "Vespasian (/vɛˈspeɪʒ(i)ən, -ziən/; Latin: Titus Flavius Vespasianus;[note 1] 17 November 9 – 24 June 79 AD)[1] was Roman emperor from 69–79, the fourth, and last, in the Year of the Four Emperors. He founded the Flavian dynasty that ruled the Empire for 27 years.\nVespasian was the first emperor who hailed from an equestrian family, and only rose into the senatorial rank as the first member of his family later in his lifetime. Vespasian's renown came from his military success; he was legate of Legio II Augusta during the Roman invasion of Britain in 43[2] and subjugated Judaea during the Jewish rebellion of 66.[3]While Vespasian besieged Jerusalem during the Jewish rebellion, emperor Nero committed suicide and plunged Rome into a year of civil war known as the Year of the Four Emperors. After Galba and Otho perished in quick succession, Vitellius became emperor in April 69. The Roman legions of Roman Egypt and Judaea reacted by declaring Vespasian, their commander, emperor on 1 July 69.[4] In his bid for imperial power, Vespasian joined forces with Mucianus, the governor of Syria, and Primus, a general in Pannonia, leaving his son Titus to command the besieging forces at Jerusalem. Primus and Mucianus led the Flavian forces against Vitellius, while Vespasian took control of Egypt. On 20 December 69, Vitellius was defeated, and the following day Vespasian was declared emperor by the Senate.[5]Little information survives about the government during Vespasian's ten-year rule. He reformed the financial system of Rome after the campaign against Judaea ended successfully, and initiated several ambitious construction projects, including the building of the Flavian Amphitheatre, better known today as the Roman Colosseum. Through his general Agricola, Vespasian increased imperial expansion in Britain. After his death in 79, he was succeeded by his eldest son Titus, thus becoming the first Roman emperor to be directly succeeded by his own natural son and establishing the Flavian dynasty.\n"
	},
	{
		"date": "June 68",
		"name": "Galba",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/7/70/Stockholm_-_Antikengalerie_4_-_B%C3%BCste_Kaiser_Galba.jpg/220px-Stockholm_-_Antikengalerie_4_-_B%C3%BCste_Kaiser_Galba.jpg",
		"history": "Servius Sulpicius Galba (/ˈsɜːrviəs sʌlˈpɪʃəs ˈɡælbə/; Latin: Servius Sulpicius Galba Caesar Augustus;[note 2] 24 December 3 BC – 15 January AD 69) was Roman emperor from 68 to 69, the first emperor in the Year of the Four Emperors. He was known as Lucius Livius Galba Ocella[note 3] prior to taking the throne as a result of his adoption by his stepmother, Livia Ocellina. The governor of Hispania at the time of the rebellion of Gaius Julius Vindex in Gaul, he seized the throne following Nero's suicide.\nBorn into a wealthy family, Galba held at various times the offices of praetor, consul, and governor of the provinces Aquitania, Upper Germany, and Africa during the first half of the first century AD. He retired during the latter part of Claudius' reign but Nero later granted him the governorship of Hispania. Taking advantage of the defeat of Vindex's rebellion and Nero's suicide, he became emperor with the support of the Praetorian Guard. His physical weakness and general apathy led to his being dominated by favorites. Unable to gain popularity with the people or maintain the support of the Praetorian Guard, Galba was murdered by Otho, who then became emperor.\n"
	},
	{
		"date": "January 69",
		"name": "Otho",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/81/Otone_-_foto_di_euthman.jpg/220px-Otone_-_foto_di_euthman.jpg",
		"history": "Otho (/ˈoʊθoʊ/; Latin: Marcus Salvius Otho Caesar Augustus;[2][3] 28 April 32 – 16 April 69) was Roman emperor for three months, from 15 January to 16 April 69. He was the second emperor of the Year of the Four Emperors.\nA member of a noble Etruscan family, Otho was initially a friend and courtier of the young emperor Nero until he was effectively banished to the governorship of the remote province of Lusitania in 58 following his wife Poppaea Sabina's affair with Nero. After a period of moderate rule in the province, he allied himself with Galba, the governor of neighbouring Hispania Tarraconensis, during the revolts of 68. He accompanied Galba on his march to Rome, but revolted and murdered Galba at the start of the next year.\nInheriting the problem of the rebellion of Vitellius, commander of the army in Germania Inferior, Otho led a sizeable force which met Vitellius' army at the Battle of Bedriacum. After initial fighting resulted in 40,000 casualties, and a retreat of his forces, Otho committed suicide rather than fight on and Vitellius was proclaimed emperor.\n"
	},
	{
		"date": "April 69",
		"name": "Vitellius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Pseudo-Vitellius_Louvre_MR684.jpg/220px-Pseudo-Vitellius_Louvre_MR684.jpg",
		"history": "Vitellius (/vɪˈtɛliəs/; Latin: Aulus Vitellius Germanicus Augustus;[1] 24 September 15 – 22 December 69 AD) was Roman Emperor for eight months, from 16 April to 22 December 69 AD. Vitellius was proclaimed emperor following the quick succession of the previous emperors Galba and Otho, in a year of civil war known as the Year of the Four Emperors. Vitellius was the first to add the honorific cognomen Germanicus to his name instead of Caesar upon his accession. Like his direct predecessor, Otho, Vitellius attempted to rally public support to his cause by honoring and imitating Nero who remained widely popular in the empire.\nHis claim to the throne was soon challenged by legions stationed in the eastern provinces, who proclaimed their commander Vespasian emperor instead. War ensued, leading to a crushing defeat for Vitellius at the Second Battle of Bedriacum in northern Italy. Once he realised his support was wavering, Vitellius prepared to abdicate in favor of Vespasian. He was not allowed to do so by his supporters, resulting in a brutal battle for Rome between Vitellius' forces and the armies of Vespasian. He was eventually executed in Rome by Vespasian's soldiers on 22 December 69.\n"
	},
	{
		"date": "July 69",
		"name": "Vespasian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/6/64/Vespasianus01_pushkin_edit.png/220px-Vespasianus01_pushkin_edit.png",
		"history": "Vespasian (/vɛˈspeɪʒ(i)ən, -ziən/; Latin: Titus Flavius Vespasianus;[note 1] 17 November 9 – 24 June 79 AD)[1] was Roman emperor from 69–79, the fourth, and last, in the Year of the Four Emperors. He founded the Flavian dynasty that ruled the Empire for 27 years.\nVespasian was the first emperor who hailed from an equestrian family, and only rose into the senatorial rank as the first member of his family later in his lifetime. Vespasian's renown came from his military success; he was legate of Legio II Augusta during the Roman invasion of Britain in 43[2] and subjugated Judaea during the Jewish rebellion of 66.[3]While Vespasian besieged Jerusalem during the Jewish rebellion, emperor Nero committed suicide and plunged Rome into a year of civil war known as the Year of the Four Emperors. After Galba and Otho perished in quick succession, Vitellius became emperor in April 69. The Roman legions of Roman Egypt and Judaea reacted by declaring Vespasian, their commander, emperor on 1 July 69.[4] In his bid for imperial power, Vespasian joined forces with Mucianus, the governor of Syria, and Primus, a general in Pannonia, leaving his son Titus to command the besieging forces at Jerusalem. Primus and Mucianus led the Flavian forces against Vitellius, while Vespasian took control of Egypt. On 20 December 69, Vitellius was defeated, and the following day Vespasian was declared emperor by the Senate.[5]Little information survives about the government during Vespasian's ten-year rule. He reformed the financial system of Rome after the campaign against Judaea ended successfully, and initiated several ambitious construction projects, including the building of the Flavian Amphitheatre, better known today as the Roman Colosseum. Through his general Agricola, Vespasian increased imperial expansion in Britain. After his death in 79, he was succeeded by his eldest son Titus, thus becoming the first Roman emperor to be directly succeeded by his own natural son and establishing the Flavian dynasty.\n"
	},
	{
		"date": "June 79",
		"name": "Titus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/3/37/Tito%2C_70-81_ca%2C_collez._albani.JPG/220px-Tito%2C_70-81_ca%2C_collez._albani.JPG",
		"history": "Titus (/ˈtaɪtəs/; Latin: Titus Flavius Caesar Vespasianus Augustus;[a] 30 December 39 AD – 13 September 81 AD) was Roman emperor from 79 to 81. A member of the Flavian dynasty, Titus succeeded his father Vespasian upon his death, thus becoming the first Roman emperor to come to the throne after his own biological father.\nBefore becoming emperor, Titus gained renown as a military commander, serving under his father in Judea during the First Jewish–Roman War. The campaign came to a brief halt with the death of emperor Nero in 68, launching Vespasian's bid for the imperial power during the Year of the Four Emperors. When Vespasian was declared Emperor on 1 July 69, Titus was left in charge of ending the Jewish rebellion. In 70, he besieged and captured Jerusalem, and destroyed the city and the Second Temple. For this achievement Titus was awarded a triumph; the Arch of Titus commemorates his victory to this day.\nDuring his father's rule, Titus gained notoriety in Rome serving as prefect of the Praetorian Guard, and for carrying on a controversial relationship with the Jewish queen Berenice. Despite concerns over his character, Titus ruled to great acclaim following the death of Vespasian in 79, and was considered a good emperor by Suetonius and other contemporary historians.\nAs emperor, Titus is best known for completing the Colosseum and for his generosity in relieving the suffering caused by two disasters, the eruption of Mount Vesuvius in AD 79 and a fire in Rome in 80. After barely two years in office, Titus died of a fever on 13 September 81. He was deified by the Roman Senate and succeeded by his younger brother Domitian.\n"
	},
	{
		"date": "September 81",
		"name": "Domitian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Domiziano_da_collezione_albani%2C_fine_del_I_sec._dc._02.JPG/220px-Domiziano_da_collezione_albani%2C_fine_del_I_sec._dc._02.JPG",
		"history": "Domitian (/dəˈmɪʃən, -iən/; Latin: Titus Flavius Caesar Domitianus Augustus;[2] 24 October 51 – 18 September 96 AD) was Roman emperor from 81 to 96. He was the younger brother of Titus and the son of  Vespasian, his two predecessors on the throne, and the last member of the Flavian dynasty.  During his reign, the authoritarian nature of his rule put him at sharp odds with the Senate, whose powers he drastically curtailed. \nDomitian had a minor and largely ceremonial role during the reigns of his father and brother. After the death of his brother, Domitian was declared emperor by the Praetorian Guard.  His 15-year reign was the longest since that of Tiberius.[3] As emperor, Domitian strengthened the economy by revaluing the Roman coinage, expanded the border defenses of the empire, and initiated a massive building program to restore the damaged city of Rome. Significant wars were fought in Britain, where his general Agricola attempted to conquer Caledonia (Scotland), and in Dacia, where Domitian was unable to procure a decisive victory against king Decebalus. Domitian's government exhibited strong authoritarian characteristics; he saw himself as the new Augustus, an enlightened despot destined to guide the Roman Empire into a new era of brilliance. Religious, military, and cultural propaganda fostered a cult of personality, and by nominating himself perpetual censor, he sought to control public and private morals. As a consequence, Domitian was popular with the people and army, but considered a tyrant by members of the Roman Senate.\nDomitian's reign came to an end in 96 when he was assassinated by court officials. He was succeeded the same day by his advisor Nerva. After his death, Domitian's memory was condemned to oblivion by the Roman Senate, while senatorial authors such as Tacitus, Pliny the Younger, and Suetonius propagated the view of Domitian as a cruel and paranoid tyrant. Modern revisionists instead have characterized Domitian as a ruthless but efficient autocrat whose cultural, economic, and political programs provided the foundation of the peaceful second century.\n"
	},
	{
		"date": "September 96",
		"name": "Nerva",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Togato%2C_I_sec_dc._con_testa_di_restauro_da_un_ritratto_di_nerva%2C_inv._2286.JPG/220px-Togato%2C_I_sec_dc._con_testa_di_restauro_da_un_ritratto_di_nerva%2C_inv._2286.JPG",
		"history": "Nerva (/ˈnɜːrvə/; Latin: Marcus Cocceius Nerva Caesar Augustus;[1] 8 November 30 – 27 January 98) was Roman emperor from 96 to 98. Nerva became emperor when aged almost 66, after a lifetime of imperial service under Nero and the rulers of the Flavian dynasty. Under Nero, he was a member of the imperial entourage and played a vital part in exposing the Pisonian conspiracy of 65. Later, as a loyalist to the Flavians, he attained consulships in 71 and 90 during the reigns of Vespasian and Domitian, respectively.\nOn 18 September 96, Domitian was assassinated in a palace conspiracy involving members of the Praetorian Guard and several of his freedmen. On the same day, Nerva was declared emperor by the Roman Senate, although it is possible they were approving a decision made by the Praetorian Guard, as rare coins show him speaking with this group. As the new ruler of the Roman Empire, he vowed to restore liberties which had been curtailed during the autocratic government of Domitian.\nNerva's brief reign was marred by financial difficulties and his inability to assert his authority over the Roman army. A revolt by the Praetorian Guard in October 97 essentially forced him to adopt an heir. After some deliberation Nerva adopted Trajan, a young and popular general, as his successor. After barely fifteen months in office, Nerva died of natural causes on 27 January 98. Upon his death he was succeeded and deified by Trajan.\nAlthough much of his life remains obscure, Nerva was considered a wise and moderate emperor by ancient historians. Nerva's greatest success was his ability to ensure a peaceful transition of power after his death by selecting Trajan as his heir, thus founding the Nerva–Antonine dynasty.\n"
	},
	{
		"date": "January 98",
		"name": "Trajan",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Traianus_Glyptothek_Munich_336.jpg/220px-Traianus_Glyptothek_Munich_336.jpg",
		"history": "Trajan (/ˈtreɪdʒən/; Latin: Imperator Caesar Nerva Traianus Divi Nervae filius Augustus;[1][2] 18 September 53 – 8 August 117) was Roman emperor from 98 to 117. Officially declared by the Senate optimus princeps (\"the best ruler\"), Trajan is remembered as a successful soldier-emperor who presided over the greatest military expansion in Roman history, leading the empire to attain its maximum territorial extent by the time of his death. He is also known for his philanthropic rule, overseeing extensive public building programs and implementing social welfare policies, which earned him his enduring reputation as the second of the Five Good Emperors who presided over an era of peace and prosperity in the Mediterranean world.\nTrajan was born in the city of Italica (close to modern Sevilla, Spain) in the province of Hispania Baetica. Although misleadingly designated by some later writers as a provincial, his family came from Umbria and he was born a Roman citizen.[3] Trajan rose to prominence during the reign of emperor Domitian. Serving as a legatus legionis in Hispania Tarraconensis, in 89 Trajan supported Domitian against a revolt on the Rhine led by Antonius Saturninus. In September 96, Domitian was succeeded by the old and childless Nerva, who proved to be unpopular with the army. After a brief and tumultuous year in power, culminating in a revolt by members of the Praetorian Guard, he was compelled to adopt the more popular Trajan as his heir and successor. Nerva died in 98 and was succeeded by his adopted son without incident.\nAs a civilian administrator, Trajan is best known for his extensive public building program, which reshaped the city of Rome and left numerous enduring landmarks such as Trajan's Forum, Trajan's Market and Trajan's Column. Early in his reign, he annexed the Nabataean Kingdom, creating the province of Arabia Petraea. His conquest of Dacia enriched the empire greatly, as the new province possessed many valuable gold mines.\nTrajan's war against the Parthian Empire ended with the sack of the capital Ctesiphon and the annexation of Armenia and Mesopotamia. His campaigns expanded the Roman Empire to its greatest territorial extent. In late 117, while sailing back to Rome, Trajan fell ill and died of a stroke in the city of Selinus. He was deified by the Senate and his ashes were laid to rest under the Column. He was succeeded by his cousin Hadrian, whom Trajan supposedly adopted on his deathbed.\n"
	},
	{
		"date": "August 117",
		"name": "Hadrian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Busts_of_Hadrianus_in_Venice_cropped.jpg/220px-Busts_of_Hadrianus_in_Venice_cropped.jpg",
		"history": "Hadrian (/ˈheɪdriən/; Latin: Publius Aelius Hadrianus Augustus; 24 January 76 – 10 July 138) was Roman emperor from 117 to 138.[note 1] He was born Publius Aelius Hadrianus in Italica, Hispania Baetica, into a Hispano-Italic family that settled in Spain from the Italian city of Atri in Picenum. His father was of senatorial rank and was a first cousin of Emperor Trajan. He married Trajan's grand-niece Vibia Sabina early in his career, before Trajan became emperor and possibly at the behest of Trajan's wife Pompeia Plotina. Plotina and Trajan's close friend and adviser Lucius Licinius Sura were well disposed towards Hadrian. When Trajan died, his widow claimed that he had nominated Hadrian as emperor immediately before his death.\nRome's military and Senate approved Hadrian's succession, but four leading senators were unlawfully put to death soon after. They had opposed Hadrian or seemed to threaten his succession, and the senate held him responsible for it and never forgave him. He earned further disapproval among the elite by abandoning Trajan's expansionist policies and territorial gains in Mesopotamia, Assyria, Armenia, and parts of Dacia. Hadrian preferred to invest in the development of stable, defensible borders and the unification of the empire's disparate peoples. He is known for building Hadrian's Wall, which marked the northern limit of Britannia.\nHadrian energetically pursued his own Imperial ideals and personal interests. He visited almost every province of the Empire, accompanied by an Imperial retinue of specialists and administrators. He encouraged military preparedness and discipline, and he fostered, designed, or personally subsidised various civil and religious institutions and building projects. In Rome itself, he rebuilt the Pantheon and constructed the vast Temple of Venus and Roma. In Egypt, he may have rebuilt the Serapeum of Alexandria. He was an ardent admirer of Greece and sought to make Athens the cultural capital of the Empire, so he ordered the construction of many opulent temples there. His intense relationship with Greek youth Antinous and Antinous' untimely death led Hadrian to establish a widespread cult late in his reign. He suppressed the Bar Kokhba revolt in Judaea, but his reign was otherwise peaceful.\nHadrian's last years were marred by chronic illness. He saw the Bar Kokhba revolt as the failure of his panhellenic ideal. He executed two more senators for their alleged plots against him, and this provoked further resentment. His marriage to Vibia Sabina had been unhappy and childless; he adopted Antoninus Pius in 138 and nominated him as a successor, on the condition that Antoninus adopt Marcus Aurelius and Lucius Verus as his own heirs. Hadrian died the same year at Baiae, and Antoninus had him deified, despite opposition from the Senate. Edward Gibbon includes him among the Empire's \"Five Good Emperors\", a \"benevolent dictator\"; Hadrian's own senate found him remote and authoritarian. He has been described as enigmatic and contradictory, with a capacity for both great personal generosity and extreme cruelty and driven by insatiable curiosity, self-conceit, and ambition.[1] Modern interest was revived largely thanks to Marguerite Yourcenar's novel Mémoires d'Hadrien (1951).\n"
	},
	{
		"date": "July 138",
		"name": "Antoninus Pius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Antoninus_Pius_Glyptothek_Munich_337_Detail.jpg/220px-Antoninus_Pius_Glyptothek_Munich_337_Detail.jpg",
		"history": "Antoninus Pius (/ˌæntəˈnaɪnəs ˈpaɪəs/; Latin: Titus Aelius Hadrianus Antoninus Augustus Pius;[2][3] 19 September 86 – 7 March 161), also known as Antoninus, was Roman emperor from 138 to 161. He was one of the Five Good Emperors in the Nerva–Antonine dynasty and the Aurelii.[4]Born into a senatorial family, Antoninus held various offices during the reign of emperor Hadrian, who adopted him as his son and successor shortly before his death. Antoninus acquired the cognomen Pius after his accession to the throne, either because he compelled the Senate to deify his adoptive father,[5] or because he had saved senators sentenced to death by Hadrian in his later years.[6] His reign is notable for the peaceful state of the Empire, with no major revolts or military incursions during this time, and for his governing without ever leaving Italy. A successful military campaign in southern Scotland early in his reign resulted in the construction of the Antonine Wall. Antoninus was an effective administrator, leaving his successors a large surplus in the treasury, expanding free access to drinking water throughout the Empire, encouraging legal conformity, and facilitating the enfranchisement of freed slaves. He died of illness in 161 and was succeeded by his adopted sons Marcus Aurelius and Lucius Verus as co-emperors.\n"
	},
	{
		"date": "161",
		"name": "Marcus Aurelius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/3/33/L%27Image_et_le_Pouvoir_-_Buste_cuirass%C3%A9_de_Marc_Aur%C3%A8le_ag%C3%A9_-_3.jpg/220px-L%27Image_et_le_Pouvoir_-_Buste_cuirass%C3%A9_de_Marc_Aur%C3%A8le_ag%C3%A9_-_3.jpg",
		"history": "Marcus Aurelius (/ɑːˈriːliəs/ or /ɑːˈriːljəs/;[1] Latin: Marcus Aurelius Antoninus Augustus; 26 April 121 – 17 March 180) was Roman emperor from 161 to 180 and a Stoic philosopher. He was the last of the rulers known as the Five Good Emperors, and the last emperor of the Pax Romana, an age of relative peace and stability for the Roman Empire. He served as Roman consul in 140, 145, and 161.\nThe son of the praetor Marcus Annius Verus (III) and the wealthy heiress Domitia Lucilla, Marcus was raised by his grandfather, Marcus Annius Verus (II), after his father died. His uncle, Antoninus Pius, adopted him shortly before becoming emperor in 138. Now heir to the throne, Marcus studied Greek and Latin under tutors such as Herodes Atticus and Marcus Cornelius Fronto. He kept in close correspondence with Fronto for many years afterwards. Marcus married Antoninus' daughter Faustina in 145. Antoninus died following an illness in 161.\nThe reign of Marcus Aurelius was marked by military conflict. In the East, the Roman Empire fought successfully with a revitalized Parthian Empire and the rebel Kingdom of Armenia. Marcus defeated the Marcomanni, Quadi, and Sarmatian Iazyges in the Marcomannic Wars; however, these and other Germanic peoples began to represent a troubling reality for the Empire. He modified the silver purity of the Roman currency, the denarius. The persecution of Christians in the Roman Empire is believed to have increased during his reign. The Antonine Plague broke out in 165 or 166 and devastated the population of the Roman Empire, causing the deaths of five million people.\nMarcus adopted an heir unlike some of his predecessors; his children included Lucilla (who married Lucius Verus, co-emperor from 161 to 169) and Commodus, whose succession after Marcus has become a subject of debate among both contemporary and modern historians. The Column and Equestrian Statue of Marcus Aurelius still stand in Rome, where they were erected in celebration of his military victories. Meditations, the writings of \"the philosopher\" – as contemporary biographers called Marcus – are a significant source of the modern understanding of ancient Stoic philosophy. They have been praised by fellow writers, philosophers, monarchs, and politicians centuries after his death.\n"
	},
	{
		"date": "March 161",
		"name": "Lucius Verus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Lucius_Verus_-_MET_-_L.2007.26_cropped.jpg/220px-Lucius_Verus_-_MET_-_L.2007.26_cropped.jpg",
		"history": "Lucius Verus (/ˈljuːʃəs ˈvɪərəs/; Latin: Lucius Aurelius Verus Augustus; 15 December 130 – 23 January 169 AD)[2] was the co-emperor of Rome with his adoptive brother Marcus Aurelius from 161 until his own death in 169. He was a member of the Nerva-Antonine dynasty. Verus' succession together with Marcus Aurelius marked the first time that the Roman Empire was ruled by multiple emperors, an increasingly common occurrence in the later history of the Empire.\nThe eldest son of Lucius Aelius Caesar, first adopted son and heir to Hadrian, Verus was born and educated in Rome where he held several political offices prior to taking the throne. After his biological father’s death in 138, he was adopted by Antoninus Pius, who was himself adopted by Hadrian. Hadrian died later that year, and Antoninus Pius succeeded to the throne.\nAntoninus Pius ruled until 161 and was succeeded by Lucius Verus and Marcus Aurelius. The majority of Verus’s reign was occupied by his direction of the war with Parthia which ended in Roman victory and some territorial gains. After initial involvement in the Marcomannic Wars, he fell ill and died in 169. He was deified by the Roman Senate as the Divine Verus (Divus Verus).\n"
	},
	{
		"date": "177",
		"name": "Commodus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Commodus_Musei_Capitolini_MC1120.jpg/220px-Commodus_Musei_Capitolini_MC1120.jpg",
		"history": "Commodus (/ˈkɒmədəs/;[1] 31 August 161 – 31 December 192), born Lucius Aurelius Commodus[2] and died Lucius Aelius Aurelius Commodus, was Roman emperor with his father Marcus Aurelius from 177 until his father's death in 180, and solely until 192.\nDuring his father's reign, he accompanied Marcus Aurelius during the Marcomannic Wars in 172 and on a tour of the Eastern provinces in 176. He was made the youngest consul in Roman history in 177 and later that year elevated to co-emperor with his father. His accession was the first time a son had succeeded his biological father since Titus succeeded Vespasian in 79. He was also the first emperor to have both a father and grandfather (who had adopted his father) as the two preceding emperors. Commodus was the first (and until 337, the only) emperor \"born in the purple\", meaning during his father's reign.\nDuring his solo reign, the Empire enjoyed a period of reduced military conflict compared with the reign of Marcus Aurelius, but intrigues and conspiracies abounded, leading Commodus to an increasingly dictatorial style of leadership that culminated in a god-like personality cult. His assassination in 192 marked the end of the Nerva–Antonine dynasty. He was succeeded by Pertinax, the first emperor in the tumultuous Year of the Five Emperors.\n"
	},
	{
		"date": "January 193",
		"name": "Pertinax",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Alba_Iulia_National_Museum_of_the_Union_2011_-_Possible_Statue_of_Roman_Emperor_Pertinax_Close_Up%2C_Apulum.JPG/220px-Alba_Iulia_National_Museum_of_the_Union_2011_-_Possible_Statue_of_Roman_Emperor_Pertinax_Close_Up%2C_Apulum.JPG",
		"history": "Pertinax (/ˈpɜːrtɪnæks/; Latin: Publius Helvius Pertinax Augustus;[note 1] 1 August 126 – 28 March 193) was a Roman soldier and politician who was Roman Emperor for the first three months of 193.[note 2] He succeeded Commodus to become the first emperor during the tumultuous Year of the Five Emperors.\nBorn the son of a freed slave, Pertinax became an officer in the army. He fought in the Roman–Parthian War of 161–166, where his success led him to be promoted to higher-ranking positions in both the military and political spheres. He achieved the rank of provincial governor and urban prefect. He was a member of the Roman Senate, serving at the same time as the historian Cassius Dio.\nFollowing the death of Commodus, Pertinax was acclaimed emperor. He attempted to institute several reform measures, although the short length of his time as emperor prevented the success of those attempts. One of those reforms, the restoration of discipline among the Praetorian Guard, led to conflict that eventually culminated in Pertinax's assassination by the Guard. Pertinax would be deified by the emperor Septimius Severus. His historical reputation has largely been a positive one, in line with the assessment of Dio.\n"
	},
	{
		"date": "193",
		"name": "Septimius Severus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/1/13/Septimius_Severus_busto-Musei_Capitolini.jpg/220px-Septimius_Severus_busto-Musei_Capitolini.jpg",
		"history": "Septimius Severus (/səˈvɪərəs/; Latin: Lucius Septimius Severus Augustus;[4] 11 April 145 – 4 February 211), also known as Severus, was Roman emperor from 193 to 211. He was born in Leptis Magna in the Roman province of Africa. As a young man he advanced through the customary succession of offices under the reigns of Marcus Aurelius and Commodus. Severus seized power after the death of Emperor Pertinax in 193 during the Year of the Five Emperors.\nAfter deposing and killing the incumbent emperor Didius Julianus, Severus fought his rival claimants, the Roman generals Pescennius Niger and Clodius Albinus. Niger was defeated in 194 at the Battle of Issus in Cilicia. Later that year Severus waged a short punitive campaign beyond the eastern frontier, annexing the Kingdom of Osroene as a new province. Severus defeated Albinus three years later at the Battle of Lugdunum in Gaul.\nAfter consolidating his rule over the western provinces, Severus waged another brief, more successful war in the east against the Parthian Empire, sacking their capital Ctesiphon in 197 and expanding the eastern frontier to the Tigris. He then enlarged and fortified the Limes Arabicus in Arabia Petraea. In 202 he campaigned in Africa and Mauretania against the Garamantes; capturing their capital Garama and expanding the Limes Tripolitanus along the southern desert frontier of the empire. He proclaimed as Augusti (co-emperors) his elder son Caracalla in 198 and his younger son Geta in 209.\nIn 208 he travelled to Britain, strengthening Hadrian's Wall and reoccupying the Antonine Wall. In the same year he invaded Caledonia (modern Scotland), but his ambitions were cut short when he fell fatally ill of an infectious disease, in late 210. Severus died in early 211 at Eboracum (today York, England), and was succeeded by his sons, thus founding the Severan dynasty. It was the last dynasty of the Roman Empire before the Crisis of the Third Century.\n"
	},
	{
		"date": "March 193",
		"name": "Didius Julianus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Didius_Julianus_%28cropped%29_-_Residenz_Museum_-_Munich.jpg/220px-Didius_Julianus_%28cropped%29_-_Residenz_Museum_-_Munich.jpg",
		"history": "Didius Julianus (/ˈdɪdiəs/; Latin: Marcus Didius Severus Julianus Augustus; born 30 January 133 or 2 February 137 – 1 June 193) was the emperor of Rome for nine weeks from March to June 193, during the Year of the Five Emperors.\nJulianus had a promising political career, governing several provinces, including Dalmatia and Germania Inferior, and successfully defeating the Chauci and Chatti, two invading Germanic tribes. He was even appointed to the consulship in 175 along with Pertinax as a reward, before being demoted by Commodus. After this demotion, his early, promising political career languished.\nHe ascended the throne after buying it from the Praetorian Guard, who had assassinated his predecessor Pertinax. A civil war ensued in which three rival generals laid claim to the imperial throne. Septimius Severus, commander of the legions in Pannonia and the nearest of the generals to Rome, marched on the capital, gathering support along the way and routing cohorts of the Praetorian Guard Didius Julianus sent to meet him. \nAbandoned by the Senate and the Praetorian Guard, Julianus was killed by a soldier in the palace and succeeded by Severus.\n"
	},
	{
		"date": "198",
		"name": "Caracalla",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Caracalla_MAN_Napoli_Inv6033_n01.jpg/220px-Caracalla_MAN_Napoli_Inv6033_n01.jpg",
		"history": "Caracalla (/ˌkærəˈkælə/; Latin: Marcus Aurelius Severus Antoninus Augustus;[1] 4 April 188 – 8 April 217), formally known as Antoninus (Ancient Greek: Ἀντωνῖνος)[2], ruled as Roman emperor from 198 to 217 AD. He was a member of the Severan dynasty, the elder son of Septimius Severus and Julia Domna. He was of Phoenician and Arab ethnicity. Co-ruler with his father from 198, he continued to rule with his brother Geta, emperor from 209, after their father's death in 211. He had his brother killed later that year, and reigned afterwards as sole ruler of the Roman Empire. Caracalla's reign featured domestic instability and external invasions by the Germanic peoples.\nCaracalla's reign became notable for the Antonine Constitution (Latin: Constitutio Antoniniana), also known as the Edict of Caracalla, which granted Roman citizenship to all free men throughout the Roman Empire. The edict gave all the enfranchised men Caracalla's adopted praenomen and nomen: \"Marcus Aurelius\". Domestically, Caracalla became known for the construction of the Baths of Caracalla, which became the second-largest baths in Rome; for the introduction of a new Roman currency named the antoninianus, a sort of double denarius; and for the massacres he enacted against the people of Rome and elsewhere in the empire. In 216, Caracalla began a campaign against the Parthian Empire. He did not see this campaign through to completion due to his assassination by a disaffected soldier in 217. Macrinus succeeded him as emperor three days later.\nThe ancient sources portray Caracalla as a tyrant and as a cruel leader, an image that has survived into modernity. Dio Cassius (c. 155 – c. 235) and Herodian (c. 170 – c. 240) present Caracalla as a soldier first and as an emperor second. In the 12th century, Geoffrey of Monmouth started the legend of Caracalla's role as the king of Britain. Later, in the 18th century, the works of French painters revived images of Caracalla due to apparent parallels between Caracalla's tyranny and that ascribed to Louis XVI of France (r. 1774–1792). Modern works continue to portray Caracalla as an evil ruler, painting him as one of the most tyrannical of all Roman emperors.\n\n"
	},
	{
		"date": "209",
		"name": "Geta",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Publius_Septimius_Geta_Louvre_Ma1076.jpg/220px-Publius_Septimius_Geta_Louvre_Ma1076.jpg",
		"history": "Geta (/ˈɡɛtə/; Latin: Publius, or Lucius, Septimius Geta Augustus;[note 1] 7 March 189 – 26 December 211)[1] was Roman emperor with his father Septimius Severus and older brother Caracalla from 209, when he was named Augustus like his brother, who had held the title since 198. Severus died in 211, and although he intended for his sons to rule together, they proved incapable of sharing power, culminating with the murder of Geta in December of that year.[2]"
	},
	{
		"date": "April 217",
		"name": "Macrinus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Bust_of_Macrinus_-_Palazzo_Nuovo_-_Musei_Capitolini_-_Rome_2016.jpg/220px-Bust_of_Macrinus_-_Palazzo_Nuovo_-_Musei_Capitolini_-_Rome_2016.jpg",
		"history": "Macrinus (/məˈkraɪnəs/; Latin: Marcus Opellius Severus Macrinus Augustus;[note 1] c. 165 – June 218) was Roman Emperor from April 217 to 8 June 218. He reigned jointly with his young son Diadumenianus. Macrinus was by origin a Berber from Mauretania Caesariensis. A member of the equestrian class, he became the first emperor who did not hail from the senatorial class and was the first emperor from Mauretania. Before becoming emperor, Macrinus served under Emperor Caracalla as a praetorian prefect and dealt with Rome's civil affairs. He later conspired against Caracalla and had him murdered in a bid to protect his own life, succeeding him as emperor.\nMacrinus was proclaimed emperor of Rome by 11 April 217 while in the eastern provinces of the empire and was subsequently confirmed as such by the Senate; however, for the duration of his reign, he never had the opportunity to return to Rome. His predecessor's policies had left Rome's coffers empty and the empire at war with several kingdoms, including Parthia, Armenia and Dacia. As emperor, Macrinus first attempted to enact reform to bring economic and diplomatic stability to Rome. While Macrinus' diplomatic actions brought about peace with each of the individual kingdoms, the additional monetary costs and subsequent fiscal reforms generated unrest in the Roman military.\nCaracalla's aunt Julia Maesa took advantage of the unrest and instigated a rebellion to have her fourteen-year-old grandson, Elagabalus, recognized as emperor. Macrinus was overthrown at the Battle of Antioch on 8 June 218 and Elagabalus proclaimed himself emperor with support from the rebelling Roman legions. Macrinus fled the battlefield and tried to reach Rome but was captured in Chalcedon and later executed in Cappadocia. He sent his son to the care of Artabanus V of Parthia, but Diadumenianus was also captured before he could reach his destination and executed. After Macrinus' death, the Senate declared him and his son enemies of Rome and had their names struck from the records and their images destroyed.\n"
	},
	{
		"date": "May 218",
		"name": "Elagabalus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Bust_of_Elagabalus_-_Palazzo_Nuovo_-_Musei_Capitolini_-_Rome_2016_%282%29.jpg/220px-Bust_of_Elagabalus_-_Palazzo_Nuovo_-_Musei_Capitolini_-_Rome_2016_%282%29.jpg",
		"history": "Elagabalus (/ˌɛləˈɡæbələs/), also known as Heliogabalus (Latin: Marcus Aurelius Antoninus Augustus; c. 204 – 11 March 222), was Roman emperor from 218 to 222. A member of the Severan dynasty, he was Syrian, the second son of Julia Soaemias and Sextus Varius Marcellus. In his early youth he served the god Elagabalus as a priest in Emesa, the hometown of his mother's family. As a private citizen, he was probably named Sextus Varius Avitus Bassianus.[1] Upon becoming emperor he took the name Marcus Aurelius Antoninus Augustus. He was called Elagabalus only after his death.[2]In 217, the emperor Caracalla was assassinated and replaced by his Praetorian prefect, Marcus Opellius Macrinus. Caracalla's maternal aunt, Julia Maesa, successfully instigated a revolt among the Third Legion to have her eldest grandson (and Caracalla's cousin), Elagabalus, declared emperor in his place. Macrinus was defeated on 8 June 218 at the Battle of Antioch. Elagabalus, barely 14 years old, became emperor, initiating a reign remembered mainly for sex scandals and religious controversy.\nLater historians suggest Elagabalus showed a disregard for Roman religious traditions and sexual taboos. He replaced the traditional head of the Roman pantheon, Jupiter, with the deity Elagabalus, of whom he had been high priest. He forced leading members of Rome's government to participate in religious rites celebrating this deity, over which he personally presided. Elagabalus was supposedly \"married\" as many as five times, lavishing favours on male courtiers popularly thought to have been his lovers,[3][4] and was reported to have prostituted himself in the imperial palace. His behavior estranged the Praetorian Guard, the Senate, and the common people alike. Amidst growing opposition, Elagabalus, just 18 years old, was assassinated and replaced by his cousin Severus Alexander on 11 March 222, who ruled for 13 years before his own assassination, which marked the epoch event for the Crisis of the Third Century. The assassination plot against Elagabalus was devised by his grandmother, Julia Maesa, and carried out by disaffected members of the Praetorian Guard.\nElagabalus developed a reputation among his contemporaries for extreme eccentricity, decadence, and zealotry.[5] This tradition has persisted, and with writers of the early modern age he suffers one of the worst reputations among Roman emperors. Edward Gibbon, for example, wrote that Elagabalus \"abandoned himself to the grossest pleasures and ungoverned fury\".[6] According to Barthold Georg Niebuhr, \"The name Elagabalus is branded in history above all others\" because of his \"unspeakably disgusting life\".[7]"
	},
	{
		"date": "May 218",
		"name": "Diadumenian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/87/Macrino%2C_aureo_per_diadoumeniano_cesare%2C_217-18%2C_01.JPG/220px-Macrino%2C_aureo_per_diadoumeniano_cesare%2C_217-18%2C_01.JPG",
		"history": "Diadumenian (/daɪˈædʊˌmiːniən/; Latin: Marcus Opellius Antoninus Diadumenianus Augustus) (September 14/19, 208 – 218), was briefly Roman Emperor from May to June 218. He was born to Macrinus, his father, of which he was co-emperor, and Nonia Celsa, whose name may be fictitious, on 14 September 208. He was elevated to Caesar in May 217, and after Elagabalus revolted a few days later, Diadumenian was elevated to co-emperor. After Macrinus was defeated in the Battle of Antioch, on 8 June 218, Diadumenian was sent to the court of Artabanus V to ensure his safety; however, he was captured and executed along the way, in late June.\n"
	},
	{
		"date": "March 222",
		"name": "Severus Alexander",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Alexander_Severus_Musei_Capitolini_MC471.jpg/220px-Alexander_Severus_Musei_Capitolini_MC471.jpg",
		"history": "Severus Alexander (/səˈvɪərəs/; Latin: Marcus Aurelius Severus Alexander Augustus;[1] c. 208 – 19 March 235) was Roman Emperor from 222 to 235 and the last emperor of the Severan dynasty. He succeeded his cousin Elagabalus upon the latter's assassination in 222. His own assassination marked the epoch event for the Crisis of the Third Century—nearly 50 years of civil wars, foreign invasion, and collapse of the monetary economy, though this last part is now disputed.\nAlexander was the heir to his cousin, the 18-year-old Emperor who had been murdered along with his mother Julia Soaemias, by his own guards, who, as a mark of contempt, had their remains cast into the Tiber river.[2] He and his cousin were both grandsons of the influential and powerful Julia Maesa, who had arranged for Elagabalus' acclamation as emperor by the famous Third Gallic Legion. It was the rumor of Alexander's death that triggered the assassination of Elagabalus and his mother.[3] His 13-year reign was the longest reign of a sole emperor since Antoninus Pius.[4] He was also the second-youngest ever sole legal Roman Emperor during the existence of the united empire, the youngest being Gordian III.\nAs emperor, Alexander's peacetime reign was prosperous. However, Rome was militarily confronted with the rising Sassanid Empire and growing incursions from the tribes of Germania. He managed to check the threat of the Sassanids. But when campaigning against Germanic tribes, Alexander attempted to bring peace by engaging in diplomacy and bribery. This alienated many in the Roman Army and led to a conspiracy to assassinate and replace him.\n"
	},
	{
		"date": "March 235",
		"name": "Maximinus Thrax",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Maximinus_Thrax_Musei_Capitolini_MC473.jpg/220px-Maximinus_Thrax_Musei_Capitolini_MC473.jpg",
		"history": "Maximinus Thrax (Latin: Gaius Iulius Verus Maximinus Augustus;[3] c. 173 – May 238), also known as Maximinus I, was Roman Emperor from 235 to 238.\nA Thraco-Roman of low birth, Maximinus was the commander of the Legio IV Italica when Severus Alexander was assassinated by his own troops in 235. The Praetorian Guard then elected Maximinus emperor.\nIn the year 238 (which came to be known as the Year of the Six Emperors), a senatorial revolt broke out, leading to the successive proclamation of Gordian I, Gordian II, Pupienus, Balbinus and Gordian III as emperors in opposition to Maximinus. Maximinus advanced on Rome to put down the revolt, but was halted at Aquileia, where he was assassinated by disaffected elements of the Legio II Parthica.\nMaximinus is described by several ancient sources, though none are contemporary except Herodian's Roman History. He was a so-called barracks emperor of the 3rd century;[4] his rule is often considered to mark the beginning of the Crisis of the Third Century. Maximinus was the first emperor who hailed neither from the senatorial class nor from the equestrian class.\n"
	},
	{
		"date": "March 238",
		"name": "Gordian II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/c7/GordianusIIsest.jpg/220px-GordianusIIsest.jpg",
		"history": "Gordian II (Latin: Marcus Antonius Gordianus Sempronianus Romanus Africanus Augustus;[3] c. 192 – April 12, 238) was Roman Emperor for 21 days with his father Gordian I in 238, the Year of the Six Emperors. Seeking to overthrow Emperor Maximinus Thrax, he died in battle outside Carthage. Since he died before his father, Gordian II had the shortest reign of any Roman Emperor in the whole of the Empire's history, at 21 days.\n"
	},
	{
		"date": "March 238",
		"name": "Gordian I",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Gordian_I_Musei_Capitolini_MC475.jpg/220px-Gordian_I_Musei_Capitolini_MC475.jpg",
		"history": "Gordian I (Latin: Caesar Marcus Antonius Gordianus Sempronianus Romanus Africanus Augustus; c. 159 AD[5] – 12 April 238 AD) was Roman Emperor for 21 days with his son Gordian II in 238, the Year of the Six Emperors. Caught up in a rebellion against the Emperor Maximinus Thrax, he was defeated by forces loyal to Maximinus, and he committed suicide after the death of his son.\n"
	},
	{
		"date": "April 238",
		"name": "Balbinus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Balbinus_Hermitage.jpg/220px-Balbinus_Hermitage.jpg",
		"history": "Balbinus (Latin: Decimus Caelius Calvinus Balbinus Pius Augustus;[1][2] c. 178 – 29 July 238), was Roman Emperor with Pupienus for three months in 238, the Year of the Six Emperors.\n"
	},
	{
		"date": "April 238",
		"name": "Pupienus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/7/79/Pupienus_Musei_Capitolini_MC477.jpg/220px-Pupienus_Musei_Capitolini_MC477.jpg",
		"history": "Pupienus (Latin: Marcus Clodius Pupienus Maximus Augustus; born c. 165/170[1] – 29 July 238), also known as Pupienus Maximus, was Roman Emperor with Balbinus for three months in 238, during the Year of the Six Emperors. The sources for this period are scant, and thus knowledge of the emperor is limited. In most contemporary texts Pupienus is referred to by his cognomen \"Maximus\" rather than by his second nomen (family name) Pupienus.\n"
	},
	{
		"date": "April 238 ",
		"name": "Gordian III",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Bust_Gordianus_III_Louvre_Ma1063.jpg/220px-Bust_Gordianus_III_Louvre_Ma1063.jpg",
		"history": "Gordian III (Latin: Marcus Antonius Gordianus Pius Augustus; 20 January 225 AD – 11 February 244 AD) was Roman Emperor from 238 AD to 244 AD. At the age of 13, he became the youngest sole legal Roman emperor throughout the existence of the united Roman Empire. Gordian was the son of Antonia Gordiana and an unnamed Roman Senator who died before 238. Antonia Gordiana was the daughter of Emperor Gordian I and younger sister of Emperor Gordian II. Very little is known of his early life before his acclamation. Gordian had assumed the name of his maternal grandfather in 238 AD.\n"
	},
	{
		"date": "February 244",
		"name": "Marcus Julius Philippus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Philippus_Arabicus.jpg/220px-Philippus_Arabicus.jpg",
		"history": "Marcus Julius Philippus (Latin: Marcus Julius Philippus Augustus [a] c. 204 – September 249 AD), also known commonly by his nickname Philip the Arab (Latin: Philippus Arabus, also known as Philip or Philip I), was Roman Emperor from February 244 to September 249. He was born in Arabia Petraea, the Roman province of Arabia, in a city situated in modern-day Syria. He went on to become a major figure in the Roman Empire. After the death of Gordian III in February 244, Philip, who had been Praetorian prefect, achieved power. He quickly negotiated peace with the Persian Sassanid Empire. During his reign, the city of Rome celebrated its millennium.\nAmong early Christian writers, Philip had the reputation of being sympathetic to the Christian faith. Probably for this reason, it was even claimed by some that he had converted to Christianity, which would have made him the first Christian emperor. He supposedly tried to celebrate Easter with Christians in Antioch, but the bishop Saint Babylas made him stand with the penitents.[1] Philip and his wife received letters from Origen.[2]Philip was betrayed and killed at the Battle of Verona in September 249 following a rebellion led by his successor, Gaius Messius Quintus Decius.\n"
	},
	{
		"date": "September 249",
		"name": "Decius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/7/79/Bust_of_Decius_%28loan_from_Capitoline_Museums%29_-_Glyptothek_-_Munich_-_Germany_2017.jpg/220px-Bust_of_Decius_%28loan_from_Capitoline_Museums%29_-_Glyptothek_-_Munich_-_Germany_2017.jpg",
		"history": "Decius (/ˈdiːʃəs, ˈdɛʃəs/; Latin: Caesar Gaius Messius Quintus Trajanus Decius Augustus;[1] c. 201 – June 251), also known as Trajan Decius, was Roman Emperor from 249 to 251.\nA distinguished politician during the reign of Philippus Arabus, Decius was proclaimed emperor by his troops after successfully putting down a rebellion in Moesia. In 249, he defeated and killed Philip near Verona and was recognized as emperor by the Senate afterwards. During his reign, he attempted to strengthen the Roman state and its religion, leading to the Decian persecution, where a number of prominent Christians (including Pope Fabian) were put to death.\nIn the last year of his reign, Decius co-ruled with his son Herennius Etruscus, until they were both killed by the Goths in the Battle of Abritus.\n"
	},
	{
		"date": "June 251",
		"name": "Trebonianus Gallus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Archeologico_di_Firenze%2C_ritratto_di_treboniano_gallo_01.JPG/220px-Archeologico_di_Firenze%2C_ritratto_di_treboniano_gallo_01.JPG",
		"history": "Trebonianus Gallus (Latin: Gaius Vibius Afinius Trebonianus Gallus Augustus;[1][2] 206 – August 253), also known as Gallus, was Roman Emperor from June 251 to August 253, in a joint rule with his son Volusianus.\n"
	},
	{
		"date": "July 251",
		"name": "Hostilian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/6/66/Grande_Ludovisi_sarcophagus_03.JPG/220px-Grande_Ludovisi_sarcophagus_03.JPG",
		"history": "Hostilian (Latin: Gaius Valens Hostilianus Messius Quintus Augustus, November 251) was Roman emperor from July to November 251. Hostilian was born to Decius and Herennia Etruscilla at an unknown date and elevated to Caesar in May 251 by Decius, the same month as his older brother, Herennius Etruscus, was raised to co-emperor. After Decius and Herennius Etruscus were killed at the Battle of Abritus, an ambush by the Goths, Trebonianus Gallus was proclaimed emperor by the legions. Almost immediately, he elevated Hostilian to co-emperor and his son, Volusianus, to Caesar. Hostilian died in November 251, either due to plague or being murdered by Trebonianus Gallus.\n"
	},
	{
		"date": "June 253",
		"name": "Aemilianus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Aemilian1.jpg/220px-Aemilian1.jpg",
		"history": "Aemilianus (Latin: Marcus Aemilius Aemilianus Augustus;[1] c. 207/213 – September 253), also known as Aemilian, was Roman Emperor for three months in 253.\nCommander of the Moesian troops, he obtained an important victory against the invading Goths and was, for this reason, acclaimed Emperor by his army. He then moved quickly to Italy, where he defeated Emperor Trebonianus Gallus at the Battle of Interamna Nahars in August 253, only to be killed by his own men a month later when another general, Valerian, proclaimed himself Emperor and moved against Aemilian with a larger army.\n"
	},
	{
		"date": "October 253",
		"name": "Valerian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Aureus_Valerian-RIC_0034-transparent.png/300px-Aureus_Valerian-RIC_0034-transparent.png",
		"history": "Valerian (/vəˈlɪəriən/; Latin: Publius Licinius Valerianus Augustus;[1] 193/195/200 – 260 or 264), also known as Valerian the Elder, was Roman Emperor from 22 October 253 AD to spring 260 AD. He was taken captive by the Persian Emperor, Shapur I, after the Battle of Edessa, becoming the first Roman emperor to be captured as a prisoner of war, causing shock and instability throughout the empire.\n"
	},
	{
		"date": "October 253",
		"name": "Gallienus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Ritratto_di_gallieno_dalla_casa_delle_vestali.jpg/220px-Ritratto_di_gallieno_dalla_casa_delle_vestali.jpg",
		"history": "Gallienus (/ˌɡæliˈɛnəs/; Latin: Publius Licinius Egnatius Gallienus Augustus;[1] c. 218 – September 268), also known as Gallien,[2] was Roman Emperor with his father Valerian from 22 October 253 to spring 260 and alone from spring 260 to September 268. He ruled during the Crisis of the Third Century that nearly caused the collapse of the empire. While he won a number of military victories, he was unable to prevent the secession of important provinces. His 15-year reign was the longest since the 19-year rule of Caracalla.\nBorn into a wealthy and traditional senatorial family, Gallienus was the son of Valerian and Mariniana. Valerian became Emperor on 22 October 253 and had the Roman senate elevate Gallienus to the ranks of Caesar and Augustus. Valerian divided the empire between him and his son, with Valerian ruling the east and his son the west. Gallienus defeated the usurper Ingenuus in 258 and destroyed an Alemanni army at Mediolanum in 259.\nThe defeat and capture of Valerian at Edessa in 260 by the Sasanian Empire threw the Roman Empire into the chaos of civil war. Control of the whole empire passed to Gallienus. He defeated the eastern usurpers Macrianus Major and Mussius Aemilianus in 261–262 but failed to stop the formation of the breakaway Gallic Empire under general Postumus. Aureolus, another usurper, proclaimed himself emperor in Mediolanum in 268 but was defeated outside the city by Gallienus and besieged inside. While the siege was ongoing, Gallienus was stabbed to death by the officer Cecropius as part of a conspiracy.\n"
	},
	{
		"date": "September 268",
		"name": "Claudius Gothicus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Santa_Giulia_4.jpg/220px-Santa_Giulia_4.jpg",
		"history": "Claudius Gothicus (Latin: Marcus Aurelius Valerius Claudius Augustus;[1] May 10, 214 – January 270), also known as Claudius II, was Roman emperor from 268 to 270. During his reign he fought successfully against the Alemanni and decisively defeated the Goths at the Battle of Naissus. He died after succumbing to \"pestilence\", possibly the Plague of Cyprian that had ravaged the provinces of the Empire.\n"
	},
	{
		"date": "270",
		"name": "Quintillus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/0/04/Antoninianus_Quintillus-s3243.jpg/220px-Antoninianus_Quintillus-s3243.jpg",
		"history": "Quintillus (Latin: Marcus Aurelius Claudius Quintillus Augustus;[1] Died April 270) was Roman Emperor for a few months in 270.\n"
	},
	{
		"date": "September 270",
		"name": "Aurelian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/en/thumb/3/3b/Aureus_of_Aurelian.jpg/220px-Aureus_of_Aurelian.jpg",
		"history": "Aurelian (Latin: Lucius Domitius Aurelianus Augustus;[a] 9 September 214 or 215 – September or October 275) was Roman Emperor from 270 to 275. Born in humble circumstances, he rose through the military ranks to become emperor. During his reign, he defeated the Alamanni after a devastating war. He also defeated the Goths, Vandals, Juthungi, Sarmatians, and Carpi. Aurelian restored the Empire's eastern provinces after his conquest of the Palmyrene Empire in 273. The following year he conquered the Gallic Empire in the west, reuniting the Empire in its entirety. He was also responsible for the construction of the Aurelian Walls in Rome, and the abandonment of the province of Dacia.\nHis successes were instrumental in ending the Roman Empire's Crisis of the Third Century, earning him the title Restitutor Orbis or \"Restorer of the World\". Although Domitian was the first emperor who had demanded to be officially hailed as dominus et deus (master and god), these titles never occurred in written form on official documents until the reign of Aurelian.[3]"
	},
	{
		"date": "275",
		"name": "Ulpia Severina",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Severina_Ant.jpg/220px-Severina_Ant.jpg",
		"history": "Ulpia Severina, also known as Severina (fl. 3rd century), was a Roman Empress, the wife of the emperor Aurelian. There is evidence that she reigned in her own right for some period after Aurelian's death in 275, which would make her the only woman to have ruled over the entire classical Roman Empire by her own power. Very little is known about her, as there are no literary sources mentioning her existence. Almost everything known about her, including her name, is gathered from coins and inscriptions.[1]"
	},
	{
		"date": "September 275",
		"name": "Tacitus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/3/37/EmpereurTacite.jpg/220px-EmpereurTacite.jpg",
		"history": "Tacitus (/ˈtæsɪtəs/; Latin: Marcus Claudius Tacitus Augustus;[1][2] c. 200 – June 276) was Roman Emperor from 275 to 276. During his short reign he campaigned against the Goths and the Heruli, for which he received the title Gothicus Maximus.\n"
	},
	{
		"date": "276",
		"name": "Probus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Probus_Musei_Capitolini_MC493.jpg/220px-Probus_Musei_Capitolini_MC493.jpg",
		"history": "Probus (/ˈproʊbəs/; Latin: Marcus Aurelius Probus Augustus;[2][3] c. 19 August 232 – September/October 282), was Roman Emperor from 276 to 282.\nProbus was an active and successful general as well as a conscientious administrator, and in his reign of six years he secured prosperity for the inner provinces while withstanding repeated inundations of hostile barbarian tribes on almost every sector of the frontier.[4]After repelling the foreign enemies of the empire Probus was forced to handle several internal revolts, but demonstrated leniency and moderation to the vanquished wherever possible.[5] In his reign the facade of the constitutional authority of the Roman Senate was fastidiously maintained, and the conqueror who had carried his arms to victory over the Rhine professed himself dependent on the sanction of the Senate.[6]Upon defeating the Germans Probus re-erected the ancient fortifications of emperor Hadrian between the Rhine and Danube rivers, protecting the Agri Decumates,[7] and exacted from the vanquished a tribute of manpower to resettle depopulated provinces within the empire and provide for adequate defense of the frontiers.[8] Despite his widespread popularity, Probus was killed in a mutiny of the soldiers while in the middle of preparations for the Persian war, which would be carried out under his successor Carus.[9]"
	},
	{
		"date": "July 276",
		"name": "Florianus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814743506051%29.jpg/220px-Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814743506051%29.jpg",
		"history": "Florianus (Latin: Marcus Annius Florianus Augustus; died 276), also known as Florian, was Roman Emperor in 276, from July to September. He was the maternal half-brother of Tacitus, who was proclaimed emperor in late 275, after the unexpected death of Emperor Aurelian. After Tacitus died in July 276, allegedly assassinated as a consequence of a military plot, Florianus proclaimed himself emperor, with the recognition of the Roman Senate and much of the empire. However, Florianus soon had to deal with the revolt of Probus, who rose up shortly after Florianus ascended the throne, with the backing of the provinces of Egypt, Syria, Palestine, and Phoenicia. Probus took advantage of the terrain of the Cilician Gates, and the hot climate of the area, which Florianus' army was unaccustomed to, to chip away at their morale. Because of this, in September 276, Florianus' army rose up against him and killed him.\n"
	},
	{
		"date": "282",
		"name": "Carinus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/6/67/Montemartini_-_Carino_cropped.JPG/220px-Montemartini_-_Carino_cropped.JPG",
		"history": "Carinus (Latin: Marcus Aurelius Carinus Augustus;[1] died 285) was Roman Emperor from 283 to 285. The elder son of emperor Carus, he was first appointed Caesar and in the beginning of 283 co-emperor of the western portion of the empire by his father. Official accounts of his character and career, which portray him as debauched and incapable, have been filtered through the propaganda of his successful opponent, Diocletian.\n"
	},
	{
		"date": "282",
		"name": "Carus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Antoninianus_of_Carus.jpg/220px-Antoninianus_of_Carus.jpg",
		"history": "Carus (Latin: Marcus Aurelius Carus Augustus;[1][2] c. 222 – July or August 283) was Roman Emperor from 282 to 283, and was 60 at ascension. During his short reign, Carus fought the Germanic tribes and Sarmatians along the Danube frontier with success.\nHe died while campaigning against the Sassanid Empire, probably of unnatural causes, as he was reportedly struck by lightning.[3] He was succeeded by his sons Carinus and Numerian, creating a dynasty which, though short-lived, provided further stability to the resurgent empire.\n"
	},
	{
		"date": "282",
		"name": "Numerian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/f/f5/NumerianusAntoninianus.jpg/220px-NumerianusAntoninianus.jpg",
		"history": "Numerian (Latin: Marcus Aurelius Numerius Numerianus Augustus;[1] died 20 November 284) was Roman Emperor from 283 to 284 with his older brother Carinus. They were sons of Carus, a general raised to the office of praetorian prefect under Emperor Probus in 282.[2]"
	},
	{
		"date": "November 284",
		"name": "Diocletian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/a/af/Istanbul_-_Museo_archeol._-_Diocleziano_%28284-305_d.C.%29_-_Foto_G._Dall%27Orto_28-5-2006.jpg/220px-Istanbul_-_Museo_archeol._-_Diocleziano_%28284-305_d.C.%29_-_Foto_G._Dall%27Orto_28-5-2006.jpg",
		"history": "Diocletian (/ˌdaɪ.əˈkliːʃən/; Latin: Gaius Aurelius Valerius Diocletianus Augustus), born Diocles (22 December 244 – 3 December 311),[4][6] was a Roman emperor from 284 to 305. Born to a family of low status in Dalmatia, Diocletian rose through the ranks of the military to become Roman cavalry commander to the Emperor Carus. After the deaths of Carus and his son Numerian on campaign in Persia, Diocletian was proclaimed emperor. The title was also claimed by Carus' surviving son, Carinus, but Diocletian defeated him in the Battle of the Margus. \nDiocletian's reign stabilized the empire and marks the end of the Crisis of the Third Century. He appointed fellow officer Maximian as Augustus, co-emperor, in 286. Diocletian reigned in the Eastern Empire, and Maximian reigned in the Western Empire. Diocletian delegated further on 1 March 293, appointing Galerius and Constantius as Caesars, junior co-emperors, under himself and Maximian respectively. Under this 'tetrarchy', or \"rule of four\", each emperor would rule over a quarter-division of the empire. Diocletian secured the empire's borders and purged it of all threats to his power. He defeated the Sarmatians and Carpi during several campaigns between 285 and 299, the Alamanni in 288, and usurpers in Egypt between 297 and 298. Galerius, aided by Diocletian, campaigned successfully against Sassanid Persia, the empire's traditional enemy. In 299 he sacked their capital, Ctesiphon. Diocletian led the subsequent negotiations and achieved a lasting and favourable peace.\nDiocletian separated and enlarged the empire's civil and military services and reorganized the empire's provincial divisions, establishing the largest and most bureaucratic government in the history of the empire. He established new administrative centres in Nicomedia, Mediolanum, Sirmium, and Trevorum, closer to the empire's frontiers than the traditional capital at Rome. Building on third-century trends towards absolutism, he styled himself an autocrat, elevating himself above the empire's masses with imposing forms of court ceremonies and architecture. Bureaucratic and military growth, constant campaigning, and construction projects increased the state's expenditures and necessitated a comprehensive tax reform. From at least 297 on, imperial taxation was standardized, made more equitable, and levied at generally higher rates.\nNot all of Diocletian's plans were successful: the Edict on Maximum Prices (301), his attempt to curb inflation via price controls, was counterproductive and quickly ignored. Although effective while he ruled, Diocletian's tetrarchic system collapsed after his abdication under the competing dynastic claims of Maxentius and Constantine, sons of Maximian and Constantius respectively. The Diocletianic Persecution (303–312), the empire's last, largest, and bloodiest official persecution of Christianity, failed to eliminate Christianity in the empire; indeed, after 324, Christianity became the empire's preferred religion under Constantine. Despite these failures and challenges, Diocletian's reforms fundamentally changed the structure of Roman imperial government and helped stabilize the empire economically and militarily, enabling the empire to remain essentially intact for another 150 years despite being near the brink of collapse in Diocletian's youth. Weakened by illness, Diocletian left the imperial office on 1 May 305, and became the first Roman emperor to abdicate the position voluntarily. He lived out his retirement in his palace on the Dalmatian coast, tending to his vegetable gardens. His palace eventually became the core of the modern-day city of Split in Croatia.\n"
	},
	{
		"date": "293",
		"name": "Constantius I Chlorus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Const.chlorus01_pushkin.jpg/220px-Const.chlorus01_pushkin.jpg",
		"history": "Constantius I (Latin: Marcus Flavius Valerius Constantius Herculius Augustus;[2][3] 31 March c. 250 – 25 July 306), commonly known as Constantius Chlorus (Greek: Κωνστάντιος Χλωρός, Kōnstantios Khlōrós, literally \"Constantius the Pale\"), was a Caesar from 293 to 305[4] and a Roman Emperor from 305 to 306. He was the father of Constantine the Great and founder of the Constantinian dynasty.\nAs Caesar, a junior emperor, he defeated the usurper Allectus in Britain and campaigned extensively along the Rhine frontier, defeating the Alamanni and Franks. Upon becoming Augustus in 305, Constantius launched a successful punitive campaign against the Picts beyond the Antonine Wall.[5] However, Constantius died suddenly in Eboracum (York) the following year. His death sparked the collapse of the tetrarchic system of government inaugurated by the Emperor Diocletian.\n"
	},
	{
		"date": "March 293",
		"name": "Galerius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/9/99/Romuliana_Galerius_head.jpg/220px-Romuliana_Galerius_head.jpg",
		"history": "Galerius (/ɡəˈlɛəriəs/; Latin: Gaius Galerius Valerius Maximianus Augustus;[12] circa 250 – April or May 311) was Roman emperor from 305 to 311.[13][citation needed] During his reign, he campaigned, aided by Diocletian, against the Sassanid Empire, sacking their capital Ctesiphon in 299.  He also campaigned across the Danube against the Carpi, defeating them in 297 and 300. Although he was a staunch opponent of Christianity, Galerius ended the Diocletianic Persecution when he issued an Edict of Toleration in Serdica in 311.\n"
	},
	{
		"date": "305",
		"name": "Maximinus Daia",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/5/50/Daza01_pushkin.jpg/220px-Daza01_pushkin.jpg",
		"history": "Maximinus II (Latin: Gaius Valerius Galerius Maximinus Daia Augustus; 20 November c. 270 – July or August 313), also known as Maximinus Daia or Maximinus Daza, was Roman Emperor from 308 to 313. He became embroiled in the Civil wars of the Tetrarchy between rival claimants for control of the empire, in which he was defeated by Licinius. A committed pagan, he engaged in one of the last persecutions of Christians.\n"
	},
	{
		"date": "May 305",
		"name": "Valerius Severus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Follis-Flavius_Valerius_Severus-trier_RIC_650a.jpg/220px-Follis-Flavius_Valerius_Severus-trier_RIC_650a.jpg",
		"history": "Valerius Severus (Latin: Flavius Valerius Severus Augustus;[1] died September 307), also Severus II,[2] was a Western Roman Emperor from 306 to 307. After failing to besiege Rome, he fled to Ravenna. It is thought that he was killed there or executed near Rome.\n"
	},
	{
		"date": "October 306",
		"name": "Maxentius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Maxentius02_pushkin.jpg/220px-Maxentius02_pushkin.jpg",
		"history": "Maxentius (Latin: Marcus Aurelius Valerius Maxentius Augustus;[2] c. 276 – 28 October 312) was Roman Emperor from 306 to 312. He was the son of former Emperor Maximian and the son-in-law of Emperor Galerius. The latter part of his reign was preoccupied with civil war, allying with Maximinus II against Licinius and Constantine. The latter defeated him at the Battle of the Milvian Bridge in 312, where Maxentius, with his army in flight, purportedly perished by drowning in the Tiber river.\n"
	},
	{
		"date": "November 308",
		"name": "Licinius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Aureus_of_Licinius.png/220px-Aureus_of_Licinius.png",
		"history": "Licinius I (/lɪˈsɪniəs/; Latin: Gaius Valerius Licinianus Licinius Augustus;[note 1][2] c. 263 – 325) was a Roman emperor from 308 to 324. For most of his reign he was the colleague and rival of Constantine I, with whom he co-authored the Edict of Milan (AD 313) that granted official toleration to Christians in the Roman Empire. He was finally defeated at the Battle of Chrysopolis (AD 324), and was later executed on the orders of Constantine I.\n"
	},
	{
		"date": "March 317",
		"name": "Constantine II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/0/06/Campidoglio%2C_Roma_-_Costantino_II_cesare_dettaglio.jpg/220px-Campidoglio%2C_Roma_-_Costantino_II_cesare_dettaglio.jpg",
		"history": "Constantine II (Latin: Flavius Claudius Constantinus Augustus;[1] January/February 316 – 340) was Roman Emperor from 337 to 340. Son of Constantine the Great and co-emperor alongside his brothers, his attempt to exert his perceived rights of primogeniture led to his death in a failed invasion of Italy in 340.\n"
	},
	{
		"date": "August 317",
		"name": "Constantius II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/7/73/Constance_II_Colosseo_Rome_Italy.jpg/220px-Constance_II_Colosseo_Rome_Italy.jpg",
		"history": "Constantius II (Latin: Flavius Julius Constantius Augustus;[1][2] Greek: Κωνστάντιος; 7 August 317 – 3 November 361) was Roman Emperor from 337 to 361. His reign saw constant warfare on the borders against the Sasanian Empire and Germanic peoples, while internally the Roman Empire went through repeated civil wars and usurpations. His religious policies inflamed domestic conflicts that would continue after his death.\nThe second son of Constantine I and Fausta, Constantius was made Caesar by his father in 324. He led the Roman army in war against the Sasanian Empire in 336. A year later, Constantine I died, and Constantius became Augustus with his brothers Constantine II and Constans. He promptly oversaw the massacre of eight of his relatives, consolidating his hold on power. The brothers divided the empire among themselves, with Constantius receiving the eastern provinces. In 340, his brothers Constantine and Constans clashed over the western provinces of the empire. The resulting conflict left Constantine dead and Constans as ruler of the west. The war against the Sasanians continued, with Constantius losing a major battle at Singara in 344. Constans was overthrown and assassinated in 350 by the usurper Magnentius. \nUnwilling to accept Magnentius as co-ruler, Constantius waged a civil war against the usurper, defeating him at the battles of Mursa Major in 351 and Mons Seleucus in 353. Magnentius committed suicide after the latter battle, leaving Constantius as sole ruler of the empire. In 351, Constantius elevated his cousin Constantius Gallus to the subordinate rank of Caesar to rule in the east, but had him executed three years later after receiving scathing reports of his violent and corrupt nature. Shortly thereafter, in 355, Constantius promoted his last surviving cousin, Gallus' younger half-brother Julian, to the rank of Caesar.\nAs emperor, Constantius promoted Arian Christianity, persecuted pagans by banning sacrifices and closing pagan temples and issued laws discriminating against Jews. His military campaigns against Germanic tribes were successful: he defeated the Alamanni in 354 and campaigned across the Danube against the Quadi and Sarmatians in 357. The war against the Sasanians, which had been in a lull since 350, erupted with renewed intensity in 359 and Constantius traveled to the east in 360 to restore stability after the loss of several border fortresses to the Sasanians. However, Julian claimed the rank of Augustus in 360, leading to war between the two after Constantius' attempts to convince Julian to back down failed. No battle was fought, as Constantius became ill and died of fever on 3 November 361 in Mopsuestia, naming Julian as his rightful successor before his death.\n"
	},
	{
		"date": "September 324",
		"name": "Constantine the Great",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Rome-Capitole-StatueConstantin.jpg/220px-Rome-Capitole-StatueConstantin.jpg",
		"history": "Constantine the Great (Latin: Flavius Valerius Aurelius Constantinus Augustus; Ancient Greek: Κωνσταντῖνος ὁ Μέγας, romanized: Kōnstantînos ho Mégas; 27 February c. 272 AD[1] – 22 May 337 AD), also known as Constantine I, was a Roman Emperor who ruled between 306 and 337 AD. Born in Naissus, in Dacia Ripensis, city now known as Niš (Serbian Cyrillic: Ниш, located in Serbia), he was the son of Flavius Valerius Constantius, a Roman Army officer of Illyrian origins.  His mother Helena was Greek. His father became Caesar, the deputy emperor in the west, in 293 AD. Constantine was sent east, where he rose through the ranks to become a military tribune under Emperors Diocletian and Galerius. In 305, Constantius was raised to the rank of Augustus, senior western emperor, and Constantine was recalled west to campaign under his father in Britannia (Britain).  Constantine was acclaimed as emperor by the army at Eboracum (modern-day York) after his father's death in 306 AD.  He emerged victorious in a series of civil wars against Emperors Maxentius and Licinius to become sole ruler of both west and east by 324 AD.\nAs emperor, Constantine enacted administrative, financial, social, and military reforms to strengthen the empire.  He restructured the government, separating civil and military authorities.  To combat inflation he introduced the solidus, a new gold coin that became the standard for Byzantine and European currencies for more than a thousand years.  The Roman army was reorganised to consist of mobile field units and garrison soldiers capable of countering internal threats and barbarian invasions.  Constantine pursued successful campaigns against the tribes on the Roman frontiers—the Franks, the Alamanni, the Goths, and the Sarmatians—even resettling territories abandoned by his predecessors during the Crisis of the Third Century.\nConstantine was the first Roman emperor to convert to Christianity.[notes 1] Although he lived much of his life as a pagan, and later as a catechumen, he joined the Christian faith on his deathbed, being baptised by Eusebius of Nicomedia.  He played an influential role in the proclamation of the Edict of Milan in 313, which declared religious tolerance for Christianity in the Roman empire.  He called the First Council of Nicaea in 325, which produced the statement of Christian belief known as the Nicene Creed.[4]  The Church of the Holy Sepulchre was built on his orders at the purported site of Jesus' tomb in Jerusalem and became the holiest place in Christendom.  The Papal claim to temporal power in the High Middle Ages was based on the forged Donation of Constantine. He has historically been referred to as the \"First Christian Emperor\", and he did heavily promote the Christian Church.  Some modern scholars, however, debate his beliefs and even his comprehension of the Christian faith itself.[notes 2]The age of Constantine marked a distinct epoch in the history of the Roman Empire.[7]  He built a new imperial residence at Byzantium and renamed the city Constantinople (now Istanbul) after himself (the laudatory epithet of \"New Rome\" came later, and was never an official title).  It became the capital of the Empire for more than a thousand years, with the later eastern Roman Empire, now being referred to as the Byzantine Empire by historians.  His more immediate political legacy was that he replaced Diocletian's tetrarchy with the principle of dynastic succession by leaving the empire to his sons.  His reputation flourished during the lifetime of his children and for centuries after his reign.  The medieval church upheld him as a paragon of virtue, while secular rulers invoked him as a prototype, a point of reference, and the symbol of imperial legitimacy and identity.[8]  Beginning with the Renaissance, there were more critical appraisals of his reign, due to the rediscovery of anti-Constantinian sources.  Trends in modern and recent scholarship have attempted to balance the extremes of previous scholarship.\n"
	},
	{
		"date": "328",
		"name": "Valens",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Valens_Honorius_Musei_Capitolini_MC494.jpg/250px-Valens_Honorius_Musei_Capitolini_MC494.jpg",
		"history": "Valens (/ˈveɪlənz/; Latin: Flavius Julius Valens Augustus;[2] Greek: Οὐάλης; 328 – 9 August 378) was Eastern Roman Emperor from 364 to 378. He was given the eastern half of the empire by his brother Valentinian I after the latter's accession to the throne. Valens was defeated and killed in the Battle of Adrianople, which marked the beginning of the collapse of the Western Roman Empire.\n"
	},
	{
		"date": "337",
		"name": "Constans",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Emperor_Constans_Louvre_Ma1021.jpg/220px-Emperor_Constans_Louvre_Ma1021.jpg",
		"history": "Constans (Latin: Flavius Julius Constans Augustus;[1] Greek: Κῶνστας Αʹ; c. 323[1][2] – 350) or Constans I was Roman Emperor from 337 to 350. He defeated his brother Constantine II in 340, but anger in the army over his personal life (homosexuality) and favouritism towards his barbarian bodyguards led the general Magnentius to rebel, resulting in the assassination of Constans in 350.\n"
	},
	{
		"date": "1 March 350",
		"name": "Vetranio",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Maiorina-Vetranio-siscia_RIC_281_%28obverse%29.jpg/220px-Maiorina-Vetranio-siscia_RIC_281_%28obverse%29.jpg",
		"history": "Vetranio (Latin: Flavius Vetranio Augustus; died c. 356), sometimes incorrectly referred to as Vetriano, was a Roman soldier, statesman and co-Emperor, a native of the province of Moesia (in modern Serbia).[1][2]"
	},
	{
		"date": "November 355",
		"name": "Julian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/cd/JulianusII-antioch%28360-363%29-CNG.jpg/220px-JulianusII-antioch%28360-363%29-CNG.jpg",
		"history": "Julian (Latin: Flavius Claudius Julianus Augustus;[a] Greek: Φλάβιος Κλαύδιος Ἰουλιανὸς Αὔγουστος; 331/332[1] – 26 June 363), was Roman Emperor from 361 to 363, as well as a notable philosopher and author in Greek.[2] His rejection of Christianity, and his promotion of Neoplatonic Hellenism in its place, caused him to be remembered as Julian the Apostate by the Christian church.[3]A member of the Constantinian dynasty, Julian was orphaned as a child. He was raised by the Gothic slave Mardonius, who had a profound influence on him, providing Julian with an excellent education.[4] Julian became Caesar over the western provinces by order of Constantius II in 355, and in this role he campaigned successfully against the Alamanni and Franks. Most notable was his crushing victory over the Alamanni at the Battle of Argentoratum (Strasbourg) in 357, leading his 13,000 men against a Germanic army three times larger. In 360, Julian was proclaimed Augustus by his soldiers at Lutetia (Paris), sparking a civil war with Constantius. However, Constantius died before the two could face each other in battle, and named Julian as his successor.\nIn 363, Julian embarked on an ambitious campaign against the Sassanid Empire. The campaign was initially successful, securing a victory outside Ctesiphon.[5] However, while campaigning into Persian territory, the Persians flooded the area behind him and Julian took a risky decision to withdraw up the valley of the Tigris River. During the Battle of Samarra, Julian was mortally wounded under mysterious circumstances,[6][4] leaving his army trapped in Persian territory. Following his death, the Roman forces were obliged to cede territory in order to escape, including the fortress city of Nisibis.[7]Julian was a man of unusually complex character: he was \"the military commander, the theosophist, the social reformer, and the man of letters\".[8] He was the last non-Christian ruler of the Roman Empire, and he believed that it was necessary to restore the Empire's ancient Roman values and traditions in order to save it from dissolution.[9] He purged the top-heavy state bureaucracy, and attempted to revive traditional Roman religious practices at the expense of Christianity. His attempt to build a Third Temple in Jerusalem was probably intended to harm Christianity rather than please Jews.[4] Julian also forbade the Christians from teaching and learning classical texts.[10]"
	},
	{
		"date": "April 359",
		"name": "Gratian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Gratian_Solidus.jpg/220px-Gratian_Solidus.jpg",
		"history": "Gratian (/ˈɡreɪʃən/; Latin: Flavius Gratianus Augustus;[1] Greek: Γρατιανός; 18 April/23 May 359 – 25 August 383) was Roman emperor from 367 to 383.\nThe eldest son of Valentinian I, Gratian accompanied, during his youth, his father on several campaigns along the Rhine and Danube frontiers. Upon the death of Valentinian in 375, Gratian's brother Valentinian II was declared emperor by his father's soldiers. In 378, Gratian's generals won a decisive victory over the Lentienses, a branch of the Alamanni, at the Battle of Argentovaria. Gratian subsequently led a campaign across the Rhine, the last emperor to do so, and attacked the Lentienses, forcing the tribe to surrender. That same year, his uncle Valens was killed in the Battle of Adrianople against the Goths. He favoured Christianity over traditional Roman religion, refusing the office of Pontifex maximus and removing the Altar of Victory from the Roman Senate.\n"
	},
	{
		"date": "June 363",
		"name": "Jovian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Jovian1.jpg/220px-Jovian1.jpg",
		"history": "Jovian (Latin: Flavius Jovianus Augustus;[1] Greek: Ἰοβιανός; 331 – 17 February 364)[2] was Roman Emperor from 363 to 364. Upon the death of emperor Julian the Apostate during his campaign against the Sassanid Empire, Jovian was hastily declared emperor by his soldiers. He sought peace with the Persians on humiliating terms and reestablished Christianity as the state church. His reign lasted only eight months.\n"
	},
	{
		"date": "February 364",
		"name": "Valentinian I",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Valentiniano_Primo.jpg/220px-Valentiniano_Primo.jpg",
		"history": "Valentinian I (Latin: Flavius Valentinianus Augustus;[1] Greek: Οὐαλεντινιανός; 3 July 321 – 17 November 375), also known as Valentinian the Great,[2][3][4][5] was Roman emperor from 364 to 375. Upon becoming emperor he made his brother Valens his co-emperor, giving him rule of the eastern provinces while Valentinian retained the west.\nDuring his reign, Valentinian fought successfully against the Alamanni, Quadi, and Sarmatians. Most notable was his victory over the Alamanni in 367 at the Battle of Solicinium. His brilliant general Count Theodosius defeated a revolt in Africa and the Great Conspiracy, a coordinated assault on Roman Britain by Picts, Scots, and Saxons. Valentinian was also the last emperor to conduct campaigns across both the Rhine and Danube rivers. Valentinian rebuilt and improved the fortifications along the frontiers, even building fortresses in enemy territory.\nDue to the successful nature of his reign and the rapid decline of the empire after his death, he is often considered to be the \"last great western emperor\". He founded the Valentinian Dynasty, with his sons Gratian and Valentinian II succeeding him in the western half of the empire.\n"
	},
	{
		"date": "November 375",
		"name": "Valentinian II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Statue_of_emperor_Valentinian_II_detail.JPG/220px-Statue_of_emperor_Valentinian_II_detail.JPG",
		"history": "Valentinian II (Latin: Flavius Valentinianus Augustus; 371 – 15 May 392), was Roman Emperor from AD 375 to 392.\n"
	},
	{
		"date": "January 379",
		"name": "Theodosius I",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/9/97/Disco_o_Missorium_Teodosio_MPLdC.jpg/300px-Disco_o_Missorium_Teodosio_MPLdC.jpg",
		"history": "Theodosius I (Latin: Flavius Theodosius Augustus;[1] Greek: Θεοδόσιος Αʹ; 11 January 347 –  17 January 395), also known as Theodosius the Great, was a Roman Emperor from 379 to 395, and the last emperor to rule over both the Eastern and the Western halves of the Roman Empire. On accepting his elevation, he campaigned against Goths and other barbarians who had invaded the Empire. His resources were not sufficient to destroy them or drive them out, which had been Roman policy for centuries in dealing with invaders. By treaty, which followed his indecisive victory at the end of the Gothic War, they were established as foederati, autonomous allies of the Empire, south of the Danube, in Illyricum, within the Empire's borders. They were given lands and allowed to remain under their own leaders, a grave departure from Roman hegemonic ways. This turn away from traditional policies was accommodationist and had grave consequences for the Western Empire from the beginning of the century, as the Romans found themselves with the impossible task of defending the borders and dealing with unruly federates within. Theodosius I was obliged to fight two destructive civil wars, successively defeating the usurpers Magnus Maximus in 387–388 and Eugenius in 394, though not without material cost to the power of the Empire.\nHe issued decrees that effectively made Nicene Christianity the official state church of the Roman Empire.[2][3] He neither prevented nor punished the destruction of prominent Hellenistic temples of classical antiquity, including the Temple of Apollo in Delphi and the Serapeum in Alexandria. He dissolved the Order of the Vestal Virgins in Rome. In 393, he banned the pagan rituals of the Olympics in Ancient Greece. After his death, Theodosius's young sons Arcadius and Honorius inherited the east and west halves of the empire respectively, and the Roman Empire was never again re-united, though Eastern Roman emperors after Zeno would claim the united title after Julius Nepos's death in 480.\nTheodosius is considered a saint by the Armenian Apostolic Church and Eastern Orthodox Church[4], and his feast day is on January 17.[5]"
	},
	{
		"date": "January 383",
		"name": "Arcadius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/41/Arcadius_Istanbul_Museum.PNG/220px-Arcadius_Istanbul_Museum.PNG",
		"history": "Arcadius (Latin: Flavius Arcadius Augustus; Greek: Ἀρκάδιος; 1 January 377 – 1 May 408) was Eastern Roman Emperor from 395 to 408. He was the eldest son of Theodosius I and his first wife Aelia Flaccilla, and brother of the Western Emperor Honorius. A weak ruler, his reign was dominated by a series of powerful ministers and by his wife, Aelia Eudoxia.[citation needed]"
	},
	{
		"date": "384",
		"name": "Magnus Maximus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/4/48/Solidus_Magnus_Maximus-constantinople_Dep_38-7_%28cropped%29.jpg",
		"history": "Magnus Maximus (Latin: Flavius Magnus Maximus Augustus, Welsh: Macsen Wledig) (c. 335–August 28, 388) was Roman Emperor in the western portion of the Empire from 383 to 388.\nIn 383, as commander of Britain, he usurped the throne against emperor Gratian, and by negotiation with emperor Theodosius I, he was made emperor in Britannia and Gaul the next year while Gratian's brother Valentinian II retained Italy, Pannonia, Hispania, and Africa. In 387, Maximus's ambitions led him to invade Italy, resulting in his defeat by Theodosius I at the Battle of the Save in 388. In the view of some historians, his death marked the end of direct imperial presence in Northern Gaul and Britain.[1]"
	},
	{
		"date": "August 392",
		"name": "Eugenius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Siliqua_Eugenius-_trier_RIC_0106d.jpg/220px-Siliqua_Eugenius-_trier_RIC_0106d.jpg",
		"history": "Flavius Eugenius (died 6 September 394) was a usurper in the western Roman Empire (392–394) against Emperor Theodosius I. He was a Pagan, and the last Emperor to support Roman polytheism.[1]"
	},
	{
		"date": "January 393",
		"name": "Honorius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/9/95/Consular_diptych_Probus_406.jpg/120px-Consular_diptych_Probus_406.jpg",
		"history": "Honorius (Latin: Flavius Honorius Augustus; 9 September 384 – 15 August 423) was Western Roman Emperor from 395 to 423. He was the younger son of emperor Theodosius I and his first wife Aelia Flaccilla, and brother of Arcadius, who was the Eastern Emperor from 395 until his death in 408. During his reign, Rome was sacked for the first time in almost 800 years.[1]Even by the standards of the rapidly declining Western Empire, Honorius's reign was precarious and chaotic. His reign was supported by his principal general, Stilicho, who was successively Honorius's guardian (during his childhood) and his father-in-law (after the emperor became an adult). Stilicho's generalship helped preserve some level of stability, but with his execution in 408, the Western Roman Empire moved closer to collapse.\n"
	},
	{
		"date": "January 402",
		"name": "Theodosius II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/2/26/Theodosius_II_Louvre_Ma1036.jpg/220px-Theodosius_II_Louvre_Ma1036.jpg",
		"history": "Theodosius II (Latin: Flavius Theodosius Junior Augustus;[1] Greek: Θεοδόσιος Βʹ; 10 April 401 – 28 July 450),[2] commonly surnamed Theodosius the Younger,[3] or Theodosius the Calligrapher, was the Eastern Roman Emperor for most of his life, taking the throne as an infant in 402 and ruling as the Eastern Empire's sole emperor after the death of his father Arcadius in 408. He is mostly known for promulgating the Theodosian law code, and for the construction of the Theodosian Walls of Constantinople. He also presided over the outbreak of two great Christological controversies, Nestorianism and Eutychianism.\n"
	},
	{
		"date": "Usurper 407",
		"name": "Constantine III",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Constantineiii.jpg/220px-Constantineiii.jpg",
		"history": "Flavius Claudius Constantinus,[2] known in English as Constantine III (died shortly before 18 September 411) was a Roman general who declared himself Western Roman Emperor in Britannia in 407 and established himself in Gaul. He was co-emperor from 409 until 411.\nConstantine rose to power during a bloody struggle in Roman Britain and was acclaimed emperor by the local legions in 407. He promptly moved to Gaul, taking all of the mobile troops from Britain, to confront the various Germanic invaders who had crossed the Rhine the previous winter. Constantine gained the upper hand after several battles with the forces of the Western Roman Emperor Honorius. As a result, Honorius recognised Constantine as co-emperor in 409. The activities of the invading tribes, raids by Saxons on the near-defenseless Britain and desertions by some of his top commanders led to a collapse of support. After further military setbacks he abdicated in 411. He was captured and executed shortly afterwards.\n"
	},
	{
		"date": "February 421",
		"name": "Constantius III",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/1/19/Solidus_Constantius_III-RIC_1325.jpg/220px-Solidus_Constantius_III-RIC_1325.jpg",
		"history": "Constantius III (Latin: Flavius Constantius Augustus) was Western Roman Emperor in 421, from 8 February until his death on 2 September. He earned his position as Emperor due to his capability as a general under Honorius, achieving the rank of Magister militum by 411. That same year, he was sent to suppress the revolt of Constantine III, a Roman general who declared himself emperor. Constantius led his army to Arles in Gaul, the capital of Constantine III, and defeated Gerontius, a general rebelling against Constantine, before himself besieging Arles. After defeating a relief force led by Edobichus, Constantius convinced Constantine to surrender, promising safe retirement, but betrayed and beheaded him as soon as he surrendered. Constantius then went on to lead campaigns against various barbarian groups in Hispania and Gaul, recovering much of both for the Western Roman Empire. Constantius was proclaimed Western Roman Emperor by Honorius on 8 February 421. He reigned for seven months before dying on 2 September 421.\n"
	},
	{
		"date": "423",
		"name": "Valentinian III",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Valentinian_III_Solidus_425_691788_%28obverse%29.jpg/220px-Valentinian_III_Solidus_425_691788_%28obverse%29.jpg",
		"history": "Valentinian III (Latin: Flavius Placidius Valentinianus Augustus;[a] 2 July 419 – 16 March 455) was Western Roman Emperor from 425 to 455. His reign was marked by the ongoing collapse of the Western Empire.\n"
	},
	{
		"date": "November 423",
		"name": "Joannes",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/83/Solidus_Johannes-s4283.png/220px-Solidus_Johannes-s4283.png",
		"history": "Ioannes, (Latin: Iohannes Augustus) known in English as Joannes or even John, was a Roman usurper (423–425) against Valentinian III.\nOn the death of the Emperor Honorius (15 August 423), Theodosius II, the remaining ruler of the House of Theodosius, hesitated in announcing his uncle's death. In the interregnum, Honorius's patrician at the time of his death, Castinus, elevated Joannes as emperor.\n"
	},
	{
		"date": "450",
		"name": "Marcian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814560242177%29.jpg/220px-Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814560242177%29.jpg",
		"history": "Marcian (/ˈmɑːrʃən/; Latin: Flavius Marcianus Augustus; Greek: Μαρκιανός; c. 392 – 26 January 457) was the Eastern Roman Emperor from 450 to 457. Very little of his life before becoming emperor is known, other than that he was a domesticus (personal assistant) who served under Ardabur and his son Aspar for fifteen years. After the death of Emperor Theodosius II on 28 July 450, Marcian was made a candidate to the throne by Aspar, who held much influence due to his military power. After a month of negotiations Pulcheria, the sister of Theodosius, agreed to marry Marcian, and Flavius Zeno, a military leader of similar influence to Aspar, agreed to help Marcian to become emperor in exchange for the rank of patrician. Marcian was elected and  inaugurated on 25 August 450.\nMarcian reversed many of the actions of his predecessor, Emperor Theodosius II, in religious matters and the Eastern Roman Empire's relationship with the Huns under Attila. Marcian almost immediately revoked all treaties with Attila, ending all subsidy payments to him. In 452, while Attila was raiding Italy, then a part of the Western Roman Empire, Marcian launched expeditions across the Danube into the Hungarian plain, defeating the Huns in their own heartland. This action, accompanied by the famine and plague that broke out in northern Italy, allowed Marcian to bribe Attila into retreating from the  Italian peninsula.\nAfter the death of Attila in 453, Marcian took advantage of the resulting fragmentation of the Hunnic confederation, settling numerous tribes within Eastern Roman lands as foederati (subject tribes which gave military service in exchange for various benefits). Marcian also convened the Council of Chalcedon, which reversed the outcome of the previous Second Council of Ephesus, and declared that Jesus had two natures, divine and human. Marcian died on 26 January 457, leaving the Eastern Roman Empire with a treasury surplus of seven million solidi. After his death, Aspar had Leo I elected as Eastern Roman Emperor.\n"
	},
	{
		"date": "July 450 ",
		"name": "Pulcheria",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/47/Pulcheria.jpg/220px-Pulcheria.jpg",
		"history": "Saint Aelia Pulcheria (/ˈiːliə pʌlˈkɪriə/; Greek: Πουλχερία; 19 January 398 or 399 – July 453)[3] was regent of the Eastern Roman Empire during the minority of her brother Theodosius II, ruling empress of the Eastern Roman Empire for a few months in 450 and then empress by marriage to Marcian until her death.\nShe was the second (and oldest surviving) child of Eastern Roman Emperor Arcadius and Empress Aelia Eudoxia. In 414, the fifteen-year old Pulcheria took over the reins of government as the guardian of her younger brother Theodosius II[4] and was also proclaimed \"augusta\". Pulcheria had significant, though changing, political power during her brother's reign. When Theodosius II died on 26 July 450, Pulcheria initially ruled in her own right before providing a successor by marrying Marcian on 25 November 450, while simultaneously not violating her vow of virginity. She died three years later, in July 453.\nPulcheria greatly influenced the Christian Church and its theological development by guiding two of the most important ecumenical councils in ecclesiastical history, namely those of Ephesus and Chalcedon, in which the Church ruled on christological issues. The Roman Catholic Church and the Eastern Orthodox Church subsequently recognized her as a saint.[5]"
	},
	{
		"date": "March 455",
		"name": "Petronius Maximus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Solidus_Petronius_Maximus-RIC_2201_%28obverse%29.jpg/220px-Solidus_Petronius_Maximus-RIC_2201_%28obverse%29.jpg",
		"history": "Petronius Maximus[1] (Latin: Flavius Anicius Petronius Maximus Augustus)[2] (c. 396 – 31 May 455[3][4]) was Western Roman Emperor for two and a half months in 455.  A wealthy senator and a prominent aristocrat, he was instrumental in the murders of the Western Roman magister militum, Flavius Aëtius, and the Western Roman Emperor, Valentinian III.\nMaximus secured the throne the day after Valentinian's death by ensuring the backing of the senate and by bribing the palace officials. He strengthened his position by forcing Valentinian's widow to marry him and forcing Valentinian's daughter to marry his son. He cancelled the betrothal of his new wife's daughter to the son of the Vandal king Genseric. This infuriated both his stepdaughter and Genseric, who sent a fleet to Rome. Maximus failed to obtain troops from the Visigoths and he fled as the Vandals arrived, became detached from his retinue and bodyguard in the confusion, and was killed. The Vandals thoroughly sacked Rome.\n"
	},
	{
		"date": "July 455",
		"name": "Avitus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Solidus_Avitus_Arles_%28obverse%29.jpg/220px-Solidus_Avitus_Arles_%28obverse%29.jpg",
		"history": "Marcus Maecilius Flavius Eparchius Avitus[i] c. 380/395[1] – after 17 October 456 or in 457) was Western Roman Emperor from 8 or 9 July 455 to 17 October 456. He was a senator and a high-ranking officer both in the civil and military administration, as well as Bishop of Piacenza.\nA Gallo-Roman  aristocrat, he opposed the reduction of the Western Roman Empire to Italy alone, both politically and from an administrative point of view. For this reason, as Emperor he introduced several Gallic senators in the Imperial administration; this policy, however, was opposed by the Senatorial aristocracy and by the people of Rome, who had suffered from the sack of the city by the Vandals in 455.\nAvitus had a good relationship with the Visigoths, in particular with their king Theodoric II, who was a friend of his and who acclaimed Avitus Emperor. The possibility of a strong and useful alliance between the Visigoths and Romans faded, however, when Theodoric invaded Hispania at Avitus' behest, which rendered him unable to help Avitus against the rebel Roman generals who deposed him.\n"
	},
	{
		"date": "457",
		"name": "Leo I",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Leo_I_Louvre_Ma1012_n2.jpg/220px-Leo_I_Louvre_Ma1012_n2.jpg",
		"history": "Leo I (Latin: Flavius Valerius Leo Augustus; 401 – 18 January 474) was Eastern Roman Emperor from 457 to 474. A native of Dacia Aureliana near historic Thrace,[1] he was known as Leo the Thracian (Greek: Λέων Α' ὁ Θρᾷξ Leōn ho Thrax).\nRuling the Eastern Empire for nearly 20 years, Leo proved to be a capable ruler. He oversaw many ambitious political and military plans, aimed mostly at aiding the faltering Western Roman Empire and recovering its former territories. He is notable for being the first Eastern Emperor to legislate in Koine Greek rather than Late Latin.[2]He is commemorated as a Saint in the Orthodox Church, with his feast day on January 20.[3][4]"
	},
	{
		"date": "April 457",
		"name": "Majorian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/3/32/Impero_d%27occidente%2C_maggioriano%2C_solido_in_oro_%28arles%29%2C_457-461.png/220px-Impero_d%27occidente%2C_maggioriano%2C_solido_in_oro_%28arles%29%2C_457-461.png",
		"history": "Flavius Julius Valerius Majorianus (c. AD 420 – August 7, 461), usually known simply as Majorian, was the Western Roman Emperor from 457 to 461.\nA prominent general of the Late Roman army, Majorian deposed Emperor Avitus in 457 and succeeded him. Majorian was the last emperor to make a concerted effort to restore the Western Roman Empire with its own forces. Possessing little more than Italy, Dalmatia, and some territory in northern Gaul, Majorian campaigned rigorously for three years against the Empire's enemies.  His successors until the fall of the Empire, in 476/480, were actually instruments of their barbarian generals, or emperors chosen and controlled by the Eastern Roman court.\nAfter defeating a Vandal attack on Italy, Majorian launched a campaign against the Visigothic Kingdom in southern Gaul. Defeating king Theodoric II at the Battle of Arelate, Majorian forced the Goths to abandon their possessions in Septimania and Hispania and return to federate status immediately. Majorian then attacked the Burgundian Kingdom, defeating them at the Siege of Lugdunum, expelling them from the Rhone valley and reducing them to federate status.\nIn 460, Majorian left Gaul to consolidate his hold on Hispania. His generals launched a campaign against the Suebic Kingdom in northwest Hispania, defeating them at the battles of Lucus Augusti and Scallabis and reducing them to federate status as well. His fleet for his planned campaign to recover Africa from the Vandals was destroyed due to treachery.\nMajorian sought to reform the imperial administration in order to make it more efficient and just. The powerful general Ricimer deposed and killed Majorian, who had become unpopular with the senatorial aristocracy because of his reforms.\nAccording to historian Edward Gibbon, Majorian \"presents the welcome discovery of a great and heroic character, such as sometimes arise, in a degenerate age, to vindicate the honour of the human species\".[1]"
	},
	{
		"date": "November 461",
		"name": "Libius Severus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/b/b1/Libius_Severus_solidus_612158_%28obverse%29.jpg",
		"history": "Libius Severus (Latin: Flavius Libius Severus Serpentius Augustus[1][2]) (Lucania, c. 420 – 15 August 465), also Severus III,[3] was Western Roman Emperor from November 19, 461 to his death.\nA Roman senator from Lucania[4] Severus was one of the last Western emperors, emptied of any effective power (the real power was in the hands of the magister militum Ricimer), and unable to solve the many problems affecting the empire; the sources describe him as a pious Christian.[5]"
	},
	{
		"date": "April 467",
		"name": "Anthemius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/c/c5/Anthemius.jpg",
		"history": "Anthemius[2] (/ænˈθɛmiəs/; Latin: Procopius Anthemius Augustus; c. 420 –  11 July 472) was Western Roman Emperor from 467 to 472.[1]Perhaps the last capable Western Roman Emperor, Anthemius attempted to solve the two primary military challenges facing the remains of the Western Roman Empire: the resurgent Visigoths, under Euric, whose domain straddled the Pyrenees; and the unvanquished Vandals, under Geiseric, in undisputed control of North Africa. Anthemius was killed by Ricimer, his own general of Gothic descent, who contested power with him.\n"
	},
	{
		"date": "March 472",
		"name": "Olybrius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/41/Tremissis_Olybrius_%28obverse%29.jpg/220px-Tremissis_Olybrius_%28obverse%29.jpg",
		"history": "Olybrius (Latin: Anicius Olybrius Augustus)[1] (died October 22 or November 2, 472) was Western Roman Emperor from April or May 472 until his death; his rule was not recognised as legitimate by the Eastern Roman Empire. He was in reality a puppet ruler put on the throne by Ricimer, a Roman general of Germanic descent, and was mainly interested in religion, while the actual power was held by Ricimer and his nephew Gundobad.\n"
	},
	{
		"date": "March 473",
		"name": "Glycerius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Solidus_Glycerius_Ravenna_%28obverse%29.jpg/220px-Solidus_Glycerius_Ravenna_%28obverse%29.jpg",
		"history": "Glycerius (Latin: Flavius Glycerius Augustus) (Unknown – after 474 AD) was  Western Roman Emperor from 473 to 474. He served as comes domesticorum (commander of the palace guard) during the reign of Olybrius, until Olybrius died on 2 November 472. After a four-month interregnum, Glycerius was proclaimed Western Emperor on 3 or 5 March 473 by the magister militum (master of soldiers) and power behind the throne Gundobad. Very few of the events of his reign are known other than that during his reign an attempted invasion of Italy by the Visigoths was repelled, diverting them to Gaul. Glycerius also prevented an invasion by the Ostrogoths through gifts. Glycerius was not recognized by the Eastern Roman Emperor Leo I, who instead nominated Julius Nepos as Emperor and sent him with an army to invade the Western Empire. Glycerius was without allies, because Gundobad had left to rule the Burgundians, and therefore was forced to abdicate on 24 June 474. He was appointed Bishop of Salona, which position he held until his death. He died some time after 474, possibly 480. He may have had a role in the assassination of Julius Nepos in 480.\n"
	},
	{
		"date": "November 473",
		"name": "Leo II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/7/78/Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814560060739%29.jpg/220px-Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814560060739%29.jpg",
		"history": "Leo II (Latin: Flavius Leo Augustus; Greek: Λέων Β', Leōn II; c.467 – 10 November 474) was briefly the Byzantine (East Roman) emperor in 474 AD when he was a child aged 7. He was the son of Zeno, the Isaurian general and future emperor, and Ariadne, the daughter of Emperor Leo I. Leo II was made co-emperor with his grandfather Leo I on 18 November 473, and became sole emperor on 18 January 474 after Leo I died of dysentery. His father Zeno was made co-emperor by the Byzantine Senate on 9 February and they co-ruled for a short time before Leo II died on 10 November 474.\n"
	},
	{
		"date": "February 474",
		"name": "Zeno",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Zeno.png/220px-Zeno.png",
		"history": "Zeno the Isaurian (/ˈziːnoʊ/; Latin: Flavius Zeno Augustus; Byzantine Greek: Ζήνων; c. 425 – 9 April 491), originally named Tarasis Kodisa Rousombladadiotes[1] /ˈtærəsɪs/, was Eastern Roman Emperor from 474 to 475 and again from 476 to 491. Domestic revolts and religious dissension plagued his reign, which nevertheless succeeded to some extent in foreign issues. His reign saw the end of the Western Roman Empire following the deposition of Romulus Augustus and the death of Julius Nepos, but he contributed much to stabilising the Eastern Empire.\nIn ecclesiastical history, Zeno is associated with the Henotikon or \"instrument of union\", promulgated by him and signed by all the Eastern bishops, with the design of solving the monophysite controversy.\n"
	},
	{
		"date": "June 474",
		"name": "Flavius Julius Nepos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Julius_Nepos_Tremissis.jpg/220px-Julius_Nepos_Tremissis.jpg",
		"history": "Julius Nepos[1] (full name: Flavius Julius Nepos Augustus; c. AD 430 – 480) was de jure and de facto Western Roman Emperor from AD 474 to 475 and then only de jure until his death in AD 480. He was also the ruler of Roman Dalmatia from 468 to 480. Some historians consider Nepos to be the final Western Roman Emperor, while others consider the western line to have ended with Romulus Augustulus in 476. In contrast, the Eastern Roman Empire and its line of emperors survived this period.\nNepos was elevated as Western Roman Emperor in AD 474 by the Eastern Roman Emperor Leo I to replace the Western Emperor Glycerius, whom he had refused to recognize. Orestes, the Magister Militum, subsequently took the government in Ravenna on August 28, 475, and deposed Nepos, forcing him to flee by ship to Dalmatia. Orestes crowned his son, Romulus Augustus, as Emperor, but neither Nepos nor the Eastern Roman court acknowledged him. A few months later the mutinous general Odoacer defeated and killed Orestes and deposed Romulus.\nNepos continued to reign in Dalmatia claiming himself as Emperor of the West and the Eastern Roman Emperor in Constantinople recognized him as such, but his power was limited to Dalmatia. Nepos was assassinated in 480, and the Eastern Roman Emperor Zeno formally abolished the Western division of the Empire.\n"
	},
	{
		"date": "January 475",
		"name": "Basiliscus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/88/Solidus_Basiliscus-RIC_1003.jpg/220px-Solidus_Basiliscus-RIC_1003.jpg",
		"history": "Basiliscus (Latin: Flavius Basiliscus Augustus; Greek: Βασιλίσκος; d. 476/477) was Eastern Roman Emperor from 475 to 476. A member of the House of Leo, he came to power when Emperor Zeno was forced out of Constantinople by a revolt.\nBasiliscus was the brother of Empress Aelia Verina, who was the wife of Emperor Leo I (457–474). His relationship with the Emperor allowed him to pursue a military career that, after minor initial successes, ended in 468, when he led the disastrous Roman invasion of Vandal Africa, in one of the largest military operations of Late Antiquity.\nBasiliscus succeeded in seizing power in 475, exploiting the unpopularity of Emperor Zeno, the \"barbarian\" successor to Leo, and a plot organised by Verina that had caused Zeno to flee Constantinople. However, during his short rule, Basiliscus alienated the fundamental support of the Church and the people of Constantinople, promoting the Miaphysite christological position in opposition to the Chalcedonian faith. Also, his policy of securing his power through the appointment of loyal men to key roles antagonised many important figures in the imperial court, including his sister Verina. So, when Zeno tried to regain his empire, he found virtually no opposition, triumphantly entering Constantinople, and capturing and killing Basiliscus and his family.\nThe struggle between Basiliscus and Zeno impeded the Eastern Roman Empire's ability to intervene in the fall of the Western Roman Empire, which happened in early September 476. When the chieftain of the Heruli, Odoacer, deposed Western Emperor Romulus Augustus, sending the imperial regalia to Constantinople, Zeno had just regained his throne, and was in no position to take any action but appoint Odoacer dux of Italy, thereby ending the Western Roman Empire.\n"
	},
	{
		"date": "October 475",
		"name": "Romulus Augustus",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/c6/RomulusAugustus.jpg/200px-RomulusAugustus.jpg",
		"history": "Flavius Romulus Augustus (c. AD 460 – after AD 476; possibly still alive as late as AD 507),[3] known derisively and historiographically as Romulus Augustulus, was the Roman emperor who ruled the Western Roman Empire from 31 October 475 until 4 September 476. He is often described as the \"last Western Roman emperor\", though some historians consider this to be Julius Nepos. His deposition by Odoacer traditionally marks the end of the Roman Empire in the West, the end of Ancient Rome, and the beginning of the Middle Ages in Western Europe.\nAlthough he, as all other emperors, adopted the name Augustus upon his accession, he is better remembered by his derisive nickname Augustulus.[4] The Latin suffix -ulus is a diminutive; hence Augustulus effectively means \"Little Augustus\".[5] The name Romulus was also changed derisively to Momyllus meaning \"little disgrace\".[6]The historical record contains few details of Romulus' life. He was the son of Orestes, a Roman who once served as a secretary in the court of Attila the Hun before coming into the service of Julius Nepos in AD 475. In the same year he was promoted to the rank of magister militum, but then led a military revolt that forced Nepos to flee into exile. With the capital of Ravenna under his control, Orestes appointed his son Romulus to the throne despite the lack of support from the eastern court in Constantinople. Romulus, however, was little more than a child and figurehead for his father's rule. After ten months in power, during which time his authority and legitimacy were disputed beyond Italy, Romulus was forced to abdicate by Odoacer, a Germanic foederatus officer who defeated and executed Orestes. After seizing control of Ravenna, Odoacer sent the former emperor to live in the Castellum Lucullanum in Campania, after which he disappears from the historical record.\n"
	},
	{
		"date": "April 491",
		"name": "Anastasius I",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Solidus_Anastasius_%28obverse%29.jpg/220px-Solidus_Anastasius_%28obverse%29.jpg",
		"history": "Anastasius I (Latin: Flavius Anastasius Augustus; Greek: Ἀναστάσιος; c. 431 – 9 July 518) was Byzantine Emperor from 491 to 518. He made his career as a government administrator. He came to the throne in his sixties after being chosen by the wife of his predecessor, Zeno. His religious tendencies caused tensions throughout his reign.\nHis reign was characterised by improvements in the government, economy, and bureaucracy in the Eastern Roman empire.[3] He is noted for leaving the imperial government with a sizeable budget surplus due to minimisation of government corruption, reforms to the tax code, and the introduction of a new form of currency.[4]"
	},
	{
		"date": "September 518",
		"name": "Justin I",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Solidus_Justin_I_%28obverse%29.jpg/220px-Solidus_Justin_I_%28obverse%29.jpg",
		"history": "Justin I (Latin: Flavius Iustinus Augustus; Greek: Ἰουστῖνος; 2 February 450 – 1 August 527) was the Eastern Roman Emperor from 518 to 527. He rose through the ranks of the army to become commander of the imperial guard when Emperor Anastasius died he out-maneouvered his rivals and was elected as his successor, in spite of being almost 70 years old. His reign is significant for the founding of the Justinian dynasty that included his eminent nephew Justinian I and three succeeding emperors. His consort was Empress Euphemia.\nHe was noted for his strongly orthodox Christian views. This facilitated the ending of the Acacian schism between the churches of Rome and Constantinople, resulting in good relations between Justin and the papacy. Throughout his reign he stressed the religious nature of his office and passed edicts against various Christian groups seen at the time as non-Orthodox. In foreign affairs he used religion as an instrument of state. He endeavoured to cultivate client states on the borders of the Empire, and avoided any significant warfare until late in his reign.\n"
	},
	{
		"date": "August 527",
		"name": "Theodora",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Meister_von_San_Vitale_in_Ravenna_008.jpg/220px-Meister_von_San_Vitale_in_Ravenna_008.jpg",
		"history": "Theodora (/ˌθiːəˈdɔːrə/; Greek: Θεοδώρα; c. 500 – 28 June 548) was empress of the Eastern Roman Empire by marriage to Emperor Justinian I. She was one of the most influential and powerful of the Eastern Roman empresses, albeit from a humble background.[1] Some sources mention her as empress regnant with Justinian I as her co-regent. Along with her spouse, she is a saint in the Eastern Orthodox Church, commemorated on November 14.\n"
	},
	{
		"date": "August 527",
		"name": "Justinian I",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Mosaic_of_Justinianus_I_-_Basilica_San_Vitale_%28Ravenna%29.jpg/220px-Mosaic_of_Justinianus_I_-_Basilica_San_Vitale_%28Ravenna%29.jpg",
		"history": "Justinian I (/dʒʌˈstɪniən/; Latin: Flavius Petrus Sabbatius Iustinianus Augustus; Greek: Φλάβιος Πέτρος Σαββάτιος Ἰουστινιανός, translit. Flávios Pétros Sabbátios Ioustinianós; c. 482 – 14 November 565), traditionally known as Justinian the Great and also Saint Justinian the Great in the Eastern Orthodox Church,[2][3] was the Eastern Roman emperor from 527 to 565. During his reign, Justinian sought to revive the empire's greatness and reconquer the lost western-half of the historical Roman Empire. Justinian's rule constitutes a distinct epoch in the history of the Later Roman empire, and his reign is marked by the ambitious but only partly realized renovatio imperii, or \"restoration of the Empire\".[4]Because of his restoration activities, Justinian has sometimes been known as the \"last Roman\" in mid 20th century historiography.[5] This ambition was expressed by the partial recovery of the territories of the defunct Western Roman Empire.[6] His general, Belisarius, swiftly conquered the Vandal Kingdom in North Africa. Subsequently, Belisarius, Narses, and other generals conquered the Ostrogothic kingdom, restoring Dalmatia, Sicily, Italy, and Rome to the empire after more than half a century of rule by the Ostrogoths. The prefect Liberius reclaimed the south of the Iberian peninsula, establishing the province of Spania. These campaigns re-established Roman control over the western Mediterranean, increasing the Empire's annual revenue by over a million solidi.[7] During his reign, Justinian also subdued the Tzani, a people on the east coast of the Black Sea that had never been under Roman rule before.[8] He engaged the Sasanian Empire in the east during Kavad I's reign, and later again during Khosrow I's; this second conflict was partially initiated due to his ambitions in the west.\nA still more resonant aspect of his legacy was the uniform rewriting of Roman law, the Corpus Juris Civilis, which is still the basis of civil law in many modern states.[9] His reign also marked a blossoming of Byzantine culture, and his building program yielded such masterpieces as the church of Hagia Sophia.\n"
	},
	{
		"date": "November 565",
		"name": "Justin II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Justin_II.jpg/220px-Justin_II.jpg",
		"history": "Justin II (Latin: Iustinus Iunior;[3] Greek: Ἰουστῖνος ὁ νεώτερος; c. 520 – 5 October 578) was Eastern Roman Emperor from 565 to 574. He was the husband of Sophia, nephew of Justinian I and the Empress Theodora, and was therefore a member of the Justinian Dynasty. His reign was marked by war with the Sassanid Empire, and the loss of the greater part of Italy.  He presented the Cross of Justin II to Saint Peter's, Rome.\n"
	},
	{
		"date": "574",
		"name": "Tiberius II Constantine",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Tiberius_II.jpg/220px-Tiberius_II.jpg",
		"history": "Tiberius II Constantine (Latin: Tiberius Constantinus; Byzantine Greek: Τιβέριος Κωνσταντῖνος; 520 – 14 August 582) was Eastern Roman Emperor from 574 to 582. Tiberius rose to power in 574 when Justin II, prior to a mental breakdown proclaimed Tiberius Caesar and adopted him as his own son. In 578, Justin II, before he died, gave him the title of Augustus, under which title he reigned until his death on 14 August 582.\n"
	},
	{
		"date": "August 582",
		"name": "Maurice",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/d/d1/Maurice_Solidus_sb0477a_%28obverse%29.jpg",
		"history": "Maurice (Latin: Mauricius; Greek: Μαυρίκιος; 539 – 27 November 602) was Byzantine Emperor from 582 to 602. A prominent general, Maurice fought with success against the Sasanian Empire. After he became Emperor, he brought the war with Sasanian Persia to a victorious conclusion. Under him the Empire's eastern border in the South Caucasus was vastly expanded and, for the first time in nearly two centuries, the Romans were no longer obliged to pay the Persians thousands of pounds of gold annually for peace.\nMaurice campaigned extensively in the Balkans against the Avars – pushing them back across the Danube by 599. He also conducted campaigns across the Danube, the first Roman Emperor to do so in over two centuries. In the west, he established two large semi-autonomous provinces called exarchates, ruled by exarchs, or viceroys of the emperor. In Italy Maurice established the Exarchate of Italy in 584, the first real effort by the Empire to halt the advance of the Lombards. With the creation of the Exarchate of Africa in 590 he further solidified the power of Constantinople in the western Mediterranean.\nHis reign was troubled by financial difficulties and almost constant warfare. In 602 a dissatisfied general named Phocas usurped the throne, having Maurice and his six sons executed. This event would prove a disaster for the Empire, sparking a twenty-six year war with Sassanid Persia which would leave both empires devastated prior to the Muslim conquests. His reign is a relatively well documented era of late antiquity, in particular by the historian Theophylact Simocatta. The Strategikon, a manual of war which influenced European and Middle Eastern military traditions for well over a millennium, is traditionally attributed to Maurice.\n"
	},
	{
		"date": "November 602",
		"name": "Phocas",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Phocas.png/220px-Phocas.png",
		"history": "Phocas (Latin: Flavius Phocas Augustus; Greek: Φωκᾶς, Phokas; c. 547 – 5 October 610) was Byzantine Emperor from 602 to 610. The early life of Phocas is largely unknown, but he rose to prominence in 602, as a leader in the revolt against Emperor Maurice. Phocas captured Constantinople and overthrew Maurice on 23 November 602, and declared himself Byzantine Emperor on the same day. Phocas deeply distrusted the elite of Constantinople, and therefore installed his relatives in high military positions, and brutally purged his opponents. Phocas was an incompetent leader, both of the administration and army, and under him the Byzantine Empire was threatened by multiple enemies, with frequent raids in the Balkans from the Avars and Slavs, and a Sassanid invasion of the eastern provinces. Because of Phocas' incompetence and brutality, the Exarch of Carthage, Heraclius the Elder, rebelled against him. Heraclius the Elder's son, Heraclius, succeeded in taking Constantinople on 5 October 610, and executed Phocas on the same day, before declaring himself the Byzantine Emperor.\n"
	},
	{
		"date": "October 610",
		"name": "Heraclius",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Heraclius_610-641.jpg/220px-Heraclius_610-641.jpg",
		"history": "Heraclius (Latin: Flavius Heraclius Augustus, Greek: Φλάβιος Ἡράκλειος, Flavios Iraklios; c. 575 – February 11, 641) was the Emperor of the Byzantine Empire from 610 to 641. His rise to power began in 608, when he and his father, Heraclius the Elder, the exarch of Africa, led a revolt against the unpopular usurper Phocas.\nHeraclius's reign was marked by several military campaigns. The year Heraclius came to power, the empire was threatened on multiple frontiers. Heraclius immediately took charge of the Byzantine–Sasanian War of 602–628. The first battles of the campaign ended in defeat for the Byzantines; the Persian army fought their way to the Bosphorus but Constantinople was protected by impenetrable walls and a strong navy, and Heraclius was able to avoid total defeat. Soon after, he initiated reforms to rebuild and strengthen the military. Heraclius drove the Persians out of Asia Minor and pushed deep into their territory, defeating them decisively in 627 at the Battle of Nineveh. The Persian king  Khosrow II was overthrown and executed by his son Kavad II, who soon sued for a peace treaty, agreeing to withdraw from all occupied territory. This way peaceful relations were restored to the two deeply strained empires.\nHeraclius lost many of his newly-regained lands to the Muslim conquests. Emerging from the Arabian Peninsula, the Muslims quickly conquered the Sasanian Empire. In 634 the Muslims marched into Roman Syria, defeating Heraclius's brother Theodore. Within a short period of time, the Arabs conquered Mesopotamia, Armenia and Egypt.\nHeraclius entered diplomatic relations with the Croats and Serbs in the Balkans. He tried to repair the schism in the Christian church in regard to the Monophysites, by promoting a compromise doctrine called Monothelitism. The Church of the East (commonly called Nestorian) was also involved in the process.[1] Eventually this project of unity was rejected by all sides of the dispute.\n"
	},
	{
		"date": "February 641",
		"name": "Heraklonas",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/a/a8/Solidus_Heraclonas_%28obverse%29.jpg",
		"history": "Constantine Heraclius (Greek: Κωνσταντῖνος Ἡράκλειος; Latin: Flavius Constantinus Heraclius (Heraclianus) Augustus; 626–641), commonly known by the diminutive Heraklonas or Herakleonas (Greek: Ἡρακλωνᾶς/Ἡρακλεωνᾶς), or rarely, Heraclius II,[1] was the son of Heraclius and his niece Martina.  His father had stipulated in his will that both of his sons should rule jointly upon his death. Heraclius also specified that his wife, Martina, was to be called \"Mother and Empress\" insofar as she might have influence at court as well.[2] The Emperor Heraclius died in February 641 from edema. When Martina did make the late Emperor's will public she faced staunch resistance to her playing any active role in government, but both Heraklonas and Constantine III were proclaimed joint-emperors in February 641 without incident.  After Constantine died of tuberculosis in April/May 641, Heraklonas became sole emperor, under the regency of his mother due to his young age.  His reign is usually dated from April/May – September/October 641, when he was overthrown by Valentinus, a general and usurper of Armenian extract, who installed Constans II, the son of Constantine III. Valentinus had Heraklonas' nose cut off, then exiled him to Rhodes, where he is believed to have died in the same year.\n"
	},
	{
		"date": "February 641",
		"name": "Constantine III",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/d/db/Solidus_Heraclius_Constantine_Obverse.jpg/220px-Solidus_Heraclius_Constantine_Obverse.jpg",
		"history": "Constantine III (Greek: Κωνσταντῖνος Γ΄; Latin: Heraclius Novus Constantinus Augustus; 3 May 612 – 20 April or 24/26 May 641) was Byzantine emperor for four months in 641, making him the shortest reigning Byzantine emperor. He was the eldest son of the Byzantine Emperor Heraclius and his first wife Eudokia.\nConstantine's birth name was Heraclius Novus Constantinus, (Greek: Ἡράκλειος νέος Κωνσταντῖνος), which was also the official name under which he reigned. The name Constantine became established in later Byzantine texts as short for the Emperor and has become standard in modern historiography. In terms of official imperial nomenclature, the style \"Constantine III\" would be more appropriate for his son Constans II (r. 641–668).\n"
	},
	{
		"date": "September 641",
		"name": "Constans II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/84/Solidus_Constans_II_%28obverse%29.jpg/220px-Solidus_Constans_II_%28obverse%29.jpg",
		"history": "Constans II (Greek: Κώνστας Β', Kōnstas II; Latin: Heraclius Constantinus Augustus or Flavius Constantinus Augustus; 7 November 630 – 15 September 668), also called Constantine the Bearded (Κωνσταντῖνος ὁ Πωγωνάτος Kōnstantinos ho Pogonatos), was emperor of the Byzantine Empire from 641 to 668. He was the last emperor to serve as consul, in 642.[1][2] Constans is a nickname given to the Emperor, who had been baptized Herakleios and reigned officially as Constantine. The nickname established itself in Byzantine texts and has become standard in modern historiography.\n"
	},
	{
		"date": "September 668",
		"name": "Constantine IV",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Sant%27apollinare_in_classe%2C_mosaici_del_catino%2C_costantino_IV_e_i_fratelli_consegnano_a_eraclio_I_privilegi_per_ravenna%2C_650-700_ca._%28molto_restaurato%29_03.jpg/220px-Sant%27apollinare_in_classe%2C_mosaici_del_catino%2C_costantino_IV_e_i_fratelli_consegnano_a_eraclio_I_privilegi_per_ravenna%2C_650-700_ca._%28molto_restaurato%29_03.jpg",
		"history": "Constantine IV (Greek: Κωνσταντῖνος Δ', romanized: Kōnstantinos IV; Latin: Flavius Constantinus Augustus; c. 652 – 14 September 685), sometimes incorrectly called Pogonatos (Πωγωνάτος), \"the Bearded\", out of confusion with his father,[1] was Byzantine Emperor from 668 to 685. His reign saw the first serious check to nearly 50 years of uninterrupted Islamic expansion, while his calling of the Sixth Ecumenical Council saw the end of the monothelitism controversy in the Byzantine Empire.\n"
	},
	{
		"date": "685",
		"name": "Justinian II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/0/02/Granting_of_privileges_mosaic_%28detail%29_-_Sant%27Apollinare_in_Classe_-_Ravenna_2016_%282%29.jpg/220px-Granting_of_privileges_mosaic_%28detail%29_-_Sant%27Apollinare_in_Classe_-_Ravenna_2016_%282%29.jpg",
		"history": "Justinian II (Greek: Ἰουστινιανός Β΄, Ioustinianos II; Latin: Flavius Iustinianus Augustus; 668 – 11 December 711), surnamed the Rhinotmetos or Rhinotmetus (ὁ Ῥινότμητος, \"the slit-nosed\"), was the last Byzantine Emperor of the Heraclian Dynasty, reigning from 685 to 695 and again from 705 to 711. Justinian II was an ambitious and passionate ruler who was keen to restore the Roman Empire to its former glories, but he responded poorly to any opposition to his will and lacked the finesse of his father, Constantine IV.[1]  Consequently, he generated enormous opposition to his reign, resulting in his deposition in 695 in a popular uprising, and he only returned to the throne in 705 with the help of a Bulgar and Slav army. His second reign was even more despotic than the first, and it too saw his eventual overthrow in 711, abandoned by his army who turned on him before killing him.\n"
	},
	{
		"date": "695",
		"name": "Leontios",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/1/16/Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814744350954%29.jpg/220px-Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814744350954%29.jpg",
		"history": "Leontios or Leontius (Greek: Λεόντιος, Latin: Leontius; c. 660 – August 705/February 706) was Byzantine emperor from 695 to 698. Little is known of his early life, other than that he was born in Isauria. He was given the title of patrikios, and made strategos of the Anatolic Theme under Emperor Constantine IV. He led forces against the Umayyads during the early years of Justinian II's reign, securing victory and forcing the Umayyad caliph, Abd al-Malik ibn Marwan, to sue for peace.\nIn 692, Justinian declared war upon the Umayyads again, and sent Leontios to campaign against them. However, he was defeated decisively after the Battle of Sebastopolis, and imprisoned for his failure by Justinian. He was released in 695, and given the title of strategos of Hellas. After being released, he led a rebellion against Justinian, and seized power, becoming emperor in the same year.\nHe ruled until 697, when he was overthrown by Apsimar, a droungarios who had taken part in a failed expedition that had been launched by Leontios, to recover Carthage. After seizing Constantinople, Apsimar took the name Tiberius III, and had Leontios' nose and tongue cut off. He was sent to the Monastery of Dalmatou, where he remained until February 706. By this time Justinian had retaken the throne. Both Leontios and Tiberius were executed.\n"
	},
	{
		"date": "February 698",
		"name": "Tiberios III",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814560029110%29.jpg/220px-Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814560029110%29.jpg",
		"history": "Tiberius III (Greek: Τιβέριος Γʹ, Tiberios III; Latin: Tiberius Augustus) was Byzantine emperor from 15 February 698 to 21 August 705. Little is known of Tiberius' early life, other than that he was droungarios of Cibyrrhaeot, and that his birth name was Apsimar. In 696, Tiberius was part of an army led by John the Patrician sent by Byzantine Emperor Leontios to retake the city of Carthage in the Exarchate of Africa, which had been captured by the Arab Umayyads. After seizing the city, This army was pushed back by Umayyad reinforcements and retreated to the island of Crete; some of the officers, fearing the wrath of Leontios, killed John and declared Tiberius emperor. Tiberius swiftly gathered a fleet, sailed for Constantinople, and deposed Leontios. Tiberius did not attempt to retake Byzantine Africa from the Umayyads, but campaigned against the Umayyads along the eastern border with some success. In 705 former Emperor Justinian II, who had been deposed by Leontios, led an army of Slavs and Bulgars to Constantinople, and after entering the city secretly, deposed Tiberius. Tiberius fled to Bithynia, but was captured several months later and beheaded between August 705 and February 706. His body was initially thrown into the sea, but was later recovered and buried in a church on the island of Prote.\n"
	},
	{
		"date": "December 711",
		"name": "Philippikos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Solidus_of_Philippicus_Bardanes.jpg/220px-Solidus_of_Philippicus_Bardanes.jpg",
		"history": "Philippikos or Philippicus (Greek: Φιλιππικός) was Emperor of the Byzantine Empire from 711 to 713.\n"
	},
	{
		"date": "June 713",
		"name": "Anastasius II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Solidus_of_Anastasius_II.jpg/220px-Solidus_of_Anastasius_II.jpg",
		"history": "Anastasius (Greek: Ἀρτέμιος Ἀναστάσιος Β΄), known in English as Anastasios II or Anastasius II (died 719), was the Byzantine Emperor from 713 to 715.\n"
	},
	{
		"date": "May 715",
		"name": "Theodosios III",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/89/Theodosios_III._front_side_of_a_solidus.jpg/220px-Theodosios_III._front_side_of_a_solidus.jpg",
		"history": "Theodosios III or Theodosius III (Greek: Θεοδόσιος Γ΄) was Byzantine Emperor from 715 to 25 March 717.\n"
	},
	{
		"date": "March 717",
		"name": "Leo III the Isaurian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Solidus_of_Leo_III_the_Isaurian.jpg/220px-Solidus_of_Leo_III_the_Isaurian.jpg",
		"history": "Leo III the Isaurian, also known as the Syrian (Greek: Λέων Γ΄ ὁ Ἴσαυρος, romanized: Leōn III ho Isauros; c. 685 – 18 June 741), was Byzantine Emperor from 717 until his death in 741 who founded the Isaurian dynasty.[1] He put an end to the Twenty Years' Anarchy, a period of great instability in the Byzantine Empire between 695 and 717, marked by the rapid succession of several emperors to the throne. He also successfully defended the Empire against the invading Umayyads and forbade the veneration of icons.[2]"
	},
	{
		"date": "June 741",
		"name": "Constantine V",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/d/da/Solidus_of_Constantine_V_Copronymus.jpg/220px-Solidus_of_Constantine_V_Copronymus.jpg",
		"history": "Constantine V (Greek: Κωνσταντῖνος Ε΄, romanized: Konstantinos V; July, 718 AD – 14 September 775 AD), denigrated by his enemies as Kopronymos or Copronymus, meaning the dung-named, was Byzantine emperor from 741 to 775. His reign saw a consolidation of Byzantine security from external threats. As an able military leader, Constantine took advantage of Muslim disunity to make limited offensives on the Arab frontier in the Byzantine–Arab wars (780–1180). With this eastern frontier secure, he undertook repeated campaigns against the Bulgars in the Balkans. His military activity, and policy of settling Christian populations from the Arab frontier in Thrace, made Byzantium's hold on its Balkan territories more secure. Religious strife and controversy was a prominent feature of his reign. His fervent support of iconoclasm and opposition to monasticism led to his vilification by later Byzantine historians and writers.\n"
	},
	{
		"date": "June 741",
		"name": "Artabasdos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Seal_of_Artabasdos_%28Schlumberger%29.png/220px-Seal_of_Artabasdos_%28Schlumberger%29.png",
		"history": "Artavasdos or Artabasdos (Greek: Ἀρταύασδος or Ἀρτάβασδος, from Armenian: Արտավազդ, Artavazd, Ardavazt), Latinized as Artabasdus, was a Byzantine general of Armenian descent who seized the throne from June 741 or 742 until November 743. His reign constitutes a usurpation against Constantine V, who had retained control of several themes in Asia Minor.\n"
	},
	{
		"date": "775",
		"name": "Leo IV",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814560071889%29.jpg/220px-Icones_imperatorvm_romanorvm%2C_ex_priscis_numismatibus_ad_viuum_delineatae%2C_and_breui_narratione_historic%C3%A2_%281645%29_%2814560071889%29.jpg",
		"history": "Leo IV the Khazar (Greek: Λέων Δ΄ ὁ Χάζαρος, Leōn IV ho Khazaros; 25 January 750 – 8 September 780) was Byzantine Emperor from 775 to 780 AD. He was born to Emperor Constantine V and Empress Tzitzak in 750. He was elevated to caesar the next year, in 751, and married to Irene of Athens in 768. When Constantine V died in September 775, while campaigning against the Bulgarians, Leo IV became senior emperor on 14 September 775. In 778 Leo raided Abbasid Syria, decisively defeating the Abbasid army outside of Germanicia. Leo died on 8 September 780, of tuberculosis. He was meant to be succeeded by his son Constantine VI, but rule instead transferred to his wife Irene, who assumed the role of regent and later empress.\n"
	},
	{
		"date": "September 780",
		"name": "Constantine VI",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Menologion_of_Basil_024.jpg/220px-Menologion_of_Basil_024.jpg",
		"history": "Constantine VI (Ancient Greek: Κωνσταντῖνος Ϛ΄, Kōnstantinos VI; 771 – before 805[1]) was Byzantine Emperor from 780 to 797. The only child of Emperor Leo IV, Constantine was named co-emperor with him at the age of five in 776 and succeeded him as sole Emperor in 780, aged nine. His mother Irene exercised control over him as regent until 790, assisted by her chief minister Staurakios and eventually only the Byzantine emperor ruled without motherhood. \nThough the regency lost power when Constantine reached maturity in 790, Irene continued to attempt to exercise control, and retained the title of Empress. Constantine suffered military defeats and made unpopular decisions, such as marrying his mistress, Theodote.  Irene had Constantine deposed, blinded and imprisoned in 797 and seized power for herself, becoming the first Empress regnant of the Empire. Constantine likely died shortly thereafter.\nConstantine VI was the final ruler to be universally recognized as Roman Emperor, being recognized as such by both the Empire which he ruled in the east, the papacy and the Western European powers over which the pope held suzerainty. With his mother becoming Empress regnant upon his deposition, the papacy crowned Charlemagne as a new Emperor in Western Europe, asserting that a woman could not be Empress in her own right. This laid the foundations of a new polity, independent of the East, that would evolve into the \"Holy Roman Empire\".[2]"
	},
	{
		"date": "April 797",
		"name": "Irene Sarantapechaina",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Gold_solidus%2C_Byzantine%2C_Irene%2C_797-802.jpg/220px-Gold_solidus%2C_Byzantine%2C_Irene%2C_797-802.jpg",
		"history": "Irene of Athens[a] (c. 752 – 9 August 803 AD), also known as Irene Sarantapechaina,[b] was Byzantine empress consort by marriage to Leo IV from 775 to 780, regent during the minority of her son Constantine VI from 780 until 790, co-regent from 792 until 797, and finally sole ruler and  first empress regnant of the Byzantine Empire from 797 to 802. A member of the politically prominent Sarantapechos family, she was selected as Leo IV's bride for unknown reasons in 768. Even though her husband was an iconoclast, she harbored iconophile sympathies. During her rule as regent, she called the Second Council of Nicaea in 787, which condemned iconoclasm as heretical and brought an end to the first iconoclast period (730–787).\nAs Irene's son Constantine reached maturity, he began to move out from under the influence of his mother. In the early 790s, several attempted revolts tried to proclaim him as sole ruler. In 797, Irene gouged out her son's eyes, maiming him so severely that he died a few days later. With her son dead, Irene proclaimed herself sole ruler. Irene's alleged unprecedented status as a female ruler of the Roman Empire (there had been women ruling the empire in their own right before, notably Pulcheria) led Pope Leo III to proclaim Charlemagne emperor of the Holy Roman Empire on Christmas Day of 800 under the pretext that a woman could not rule and so the throne of the Roman Empire was actually vacant. A revolt in 802 overthrew Irene and exiled her to the island of Lesbos, supplanting her on the throne with Nikephoros I. Irene died in exile less than a year later.\n"
	},
	{
		"date": "October 802",
		"name": "Nikephoros I",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Nicephorus_I_Logothetes.jpg/200px-Nicephorus_I_Logothetes.jpg",
		"history": "Nikephoros I, or Nicephorus I (Greek: Νικηφόρος Α΄, Nikēphoros I; died July 26, 811), was Byzantine Emperor from 802 to 811, when he was killed in the Battle of Pliska. Prior to his accession, he had served as genikos logothetēs, whence he is sometimes surnamed \"the Logothete\" (ὁ Λογοθέτης) and \"Genikos\" or \"Genicus\" (ὁ Γενικός).\n"
	},
	{
		"date": "July 811",
		"name": "Staurakios",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Solidus-Stauracius.jpg/220px-Solidus-Stauracius.jpg",
		"history": "Staurakios or Stauracius (Greek: Σταυράκιος; After 778 – 11 January 812 AD) was Byzantine Emperor from 26 July to 2 October 811. He was born some time after 778 AD, to Nikephoros I and an unknown woman. Nikephoros seized the throne of the Byzantine Empire from Irene of Athens in 802, and elevated Staurakios to co-emperor in December 803. After Nikephoros fell in the Battle of Pliska on 26 July 811, Staurakios was declared emperor, despite his severe injuries. However, due to these injuries his reign was short, he was usurped by his brother-in-law, Michael I Rangabe, on 2 October 811, after which he was sent to live in a monastery, where he stayed until he died of gangrene on 11 January 812.\n"
	},
	{
		"date": "October 811",
		"name": "Michael I Rangabe",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/0/0b/Michael_I_Rangabe.jpg",
		"history": "Michael I Rhangabe (Greek: Μιχαῆλ Ῥαγκαβές, Michaēl Rhangabe; c. 770 – 11 January 844) was Byzantine Emperor from 811 to 813.  \nMichael was the son of the patrician Theophylact Rhangabe, the admiral of the Aegean fleet.[1]  He married Prokopia, the daughter of the future Emperor Nikephoros I,[2] and received the high court dignity of kouropalatēs after his father-in-law's accession in 802.\n"
	},
	{
		"date": "June 813",
		"name": "Leo V the Armenian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/44/Leo_V_solidus.jpg/220px-Leo_V_solidus.jpg",
		"history": "Leo V the Armenian (Greek: Λέων ὁ ἐξ Ἀρμενίας, Leōn ho ex Armenias; 775 – 24 December 820) was Emperor of the Byzantine Empire from 813 to 820. A senior general, he forced his predecessor, Michael I Rangabe, to abdicate and assumed the throne. He ended the decade-long war with the Bulgars, and initiated the second period of Byzantine Iconoclasm. He was assassinated by supporters of Michael the Amorian, one of his most trusted generals, who succeeded him on the throne.\n"
	},
	{
		"date": "December 820",
		"name": "Michael II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/6/67/Michael_II_and_Theophilos_solidus.jpg/220px-Michael_II_and_Theophilos_solidus.jpg",
		"history": "Michael II (Greek: Μιχαήλ Β', Mikhaēl II), (770- 829), surnamed the Amorian (ὁ ἐξ Ἀμορίου) or the Stammerer (ὁ Τραυλός or ὁ Ψελλός), reigned as Byzantine Emperor from 25 December 820 to his death on 2 October 829, the first ruler of the Phrygian or Amorian dynasty.\nBorn in Amorium, Michael was a soldier, rising to high rank along with his colleague Leo V the Armenian (r. 813–820). He helped Leo overthrow and take the place of Emperor Michael I Rangabe. However, after they fell out Leo sentenced Michael to death. Michael then masterminded a conspiracy which resulted in Leo's assassination at Christmas in 820. Immediately he faced the long revolt of Thomas the Slav, which almost cost him his throne and was not completely quelled until spring 824. The later years of his reign were marked by two major military disasters that had long-term effects: the beginning of the Muslim conquest of Sicily, and the loss of Crete to the Saracens. Domestically, he supported and strengthened the resumption of official iconoclasm, which had begun again under Leo V.\n"
	},
	{
		"date": "842",
		"name": "Michael III",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/0/0e/Michael_iii.jpg",
		"history": "Michael III  (Greek: Μιχαήλ Γʹ, Mikhaēl III; January 19, 840 – September 23/24, 867) was Byzantine Emperor from 842 to 867. Michael III was the third and traditionally last member of the Amorian (or Phrygian) dynasty. He was given the disparaging epithet the Drunkard (ὁ Μέθυσος) by the hostile historians of the succeeding Macedonian dynasty, but modern historical research has rehabilitated his reputation to some extent, demonstrating the vital role his reign played in the resurgence of Byzantine power in the 9th century.[1][2]"
	},
	{
		"date": "867",
		"name": "Basil I",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/6/66/Solidus-Basil_I_with_Constantine_and_Eudoxia-sb1703.jpg/220px-Solidus-Basil_I_with_Constantine_and_Eudoxia-sb1703.jpg",
		"history": "Basil I, called the Macedonian (Greek: Βασίλειος ὁ Μακεδών, Basíleios ō Makedṓn; 811 – August 29, 886) was a Byzantine Emperor who reigned from 867 to 886. Born a simple peasant in the theme of Macedonia, he rose in the Imperial court. He entered into the service of Theophilitzes, a relative of Emperor Michael III (r. 842–867), and was given a fortune by the wealthy Danielis. He gained the favour of Michael III, whose mistress he married on the emperor's orders, and was proclaimed co-emperor in 866. He ordered the assassination of Michael the next year. Despite his humble origins, he showed great ability in running the affairs of state. He was the founder of the Macedonian dynasty. He was succeeded upon his death by his son (perhaps actually Michael III's son) Leo VI.\n"
	},
	{
		"date": "August 886",
		"name": "Leo VI",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/46/Detail_of_the_Imperial_Gate_mosaic_in_Hagia_Sophia_showing_Leo_VI_the_Wise.jpg/220px-Detail_of_the_Imperial_Gate_mosaic_in_Hagia_Sophia_showing_Leo_VI_the_Wise.jpg",
		"history": "Leo VI, called the Wise or the Philosopher (Greek: Λέων Ϝ΄ ὁ Σοφός, Leōn VI ho Sophos, 19 September 866 – 11 May 912), was Byzantine Emperor from 886 to 912. The second ruler of the Macedonian dynasty (although his parentage is unclear), he was very well-read, leading to his epithet. During his reign, the renaissance of letters, begun by his predecessor Basil I, continued; but the Empire also saw several military defeats in the Balkans against Bulgaria and against the Arabs in Sicily and the Aegean. His reign also witnessed the formal discontinuation of several ancient Roman institutions, such as the Roman consul and Senate (in this period also known as the Byzantine Senate), which continued to exist in name only and lost much of their original functions and powers.\n"
	},
	{
		"date": "May 908",
		"name": "Constantine VII",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Constantine_VII_Porphyrogenitus.jpg/220px-Constantine_VII_Porphyrogenitus.jpg",
		"history": "Constantine VII Porphyrogennetos or Porphyrogenitus (Greek: Κωνσταντῖνος Ζ΄ Πορφυρογέννητος, romanized: Kōnstantinos VII Porphyrogennētos; 17–18 May  905 – 9 November  959) was the fourth Emperor of the Macedonian dynasty of the Byzantine Empire, reigning from 913 to 959. He was the son of the emperor Leo VI and his fourth wife, Zoe Karbonopsina, and the nephew of his predecessor, the emperor Alexander.\nMost of his reign was dominated by co-regents: from 913 until 919 he was under the regency of his mother, while from 920 until 945 he shared the throne with Romanos Lekapenos, whose daughter Helena he married, and his sons. Constantine VII is best known for his four books, De Administrando Imperio (bearing in Greek the heading Πρὸς τὸν ἴδιον υἱὸν Ῥωμανόν),[2] De Ceremoniis (Περὶ τῆς Βασιλείου Τάξεως), De Thematibus (Περὶ θεμάτων Άνατολῆς καὶ Δύσεως), and Vita Basilii (Βίος Βασιλείου).[3]His nickname alludes to the Purple Room of the imperial palace, decorated with porphyry, where legitimate children of reigning emperors were normally born. Constantine was also born in this room, although his mother Zoe had not been married to Leo at that time. Nevertheless, the epithet allowed him to underline his position as the legitimized son, as opposed to all others who claimed the throne during his lifetime. Sons born to a reigning Emperor held precedence in the Eastern Roman line of succession over elder sons not born \"in the purple\".\n"
	},
	{
		"date": "920",
		"name": "Romanos I Lekapenos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/45/Romanos_I_with_co-emperors%2C_miliaresion%2C_931-944_AD.jpg/220px-Romanos_I_with_co-emperors%2C_miliaresion%2C_931-944_AD.jpg",
		"history": "Romanos I Lekapenos or Lakapenos (Greek: Ρωμανός Α΄ Λακαπηνός, Rōmanos I Lakapēnos; c. 870 – June 15, 948), Latinized as Romanus I Lecapenus, was an Armenian who became a Byzantine naval commander and reigned as Byzantine Emperor from 920 until his deposition on December 16, 944.\n"
	},
	{
		"date": "April 945",
		"name": "Romanos II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Constantine_VII_and_Romanos_II_solidus_%28cropped%29.png/220px-Constantine_VII_and_Romanos_II_solidus_%28cropped%29.png",
		"history": "Romanos (or Romanus) II (Greek: Ρωμανός Β΄, Rōmanos II) (938 – 15 March 963) was a Byzantine Emperor. He succeeded his father Constantine VII in 959 at the age of twenty-one and died suddenly in 963.\n"
	},
	{
		"date": "962",
		"name": "Constantine VIII",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/d/da/Histamenon_nomisma-Constantine_VIII-sb1776_%28reverse%29.jpg",
		"history": "Constantine VIII (Greek: Κωνσταντῖνος Η΄, Kōnstantinos VIII) (960 – 11 November 1028) was the Byzantine Emperor from 15 December 1025 until his death in 1028. He was the younger son of Emperor Romanos II and Empress Theophano. He was nominal co-emperor for 63 years from 962, successively with his father; stepfather, Nikephoros II; uncle (by marriage), John I; and brother, Basil II.\nBasil II died childless in 1025 and thus left the rule of the Byzantine Empire in Constantine's hands. Constantine had no interest in politics, statecraft or the military. His brief reign is said to have been \"an unmitigated disaster\", sparking \"a collapse of the military power of the Empire\". Constantine had no sons, so shortly before his death he married his daughter Zoë to his chosen successor Romanos Argyros. \n"
	},
	{
		"date": "August 963",
		"name": "Nikephoros II Phokas",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Nikiphoros_Phokas.jpg/220px-Nikiphoros_Phokas.jpg",
		"history": "Nikephoros II Phokas (Latinized: Nicephorus II Phocas; Νικηφόρος Β΄ Φωκᾶς, Nikēphóros II Phōkãs; c. 912 – 11 December 969) was Byzantine Emperor from 963 to 969.  His brilliant military exploits contributed to the resurgence of the Byzantine Empire during the 10th century. His reign, however, included controversy. In the west, he inflamed conflict with the Bulgarians and saw Sicily completely turn over to the Muslims, while he failed to make any serious gains in Italy following the incursions of Otto I. Meanwhile, in the east, he completed the conquest of Cilicia and even retook the island of Cyprus, thus opening the path for subsequent Byzantine incursions reaching as far as the Jazira and the Levant. His administrative policy was less successful, as in order to finance these wars he increased taxes both on the people and on the church, while maintaining unpopular theological positions and alienating many of his most powerful allies. These included his nephew John Tzimiskes, who would take the throne after killing Nikephoros in his sleep.\n"
	},
	{
		"date": "December 969",
		"name": "John I Tzimiskes",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/7/79/Histamenon_John_Tzimiskes.png/220px-Histamenon_John_Tzimiskes.png",
		"history": "John I Tzimiskes (Greek: Ἰωάννης Α΄ Τζιμισκής, Iōánnēs I Tzimiskēs; c. 925 – 10 January 976) was the senior Byzantine Emperor from 11 December 969 to 10 January 976. An intuitive and successful general, he strengthened the Empire and expanded its borders during his short reign.[1]"
	},
	{
		"date": "January 976",
		"name": "Basil II",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Basilios_II.jpg/220px-Basilios_II.jpg",
		"history": "Basil II (Greek: Βασίλειος, romanized: Basileios;[note 2] c. 958 – 15 December 1025), nicknamed the Bulgar Slayer (Greek: ὁ Βουλγαροκτόνος, romanized: ho Boulgaroktonos),[note 3] was senior Byzantine Emperor for almost 50 years (10 January 976 – 15 December 1025), having been a junior colleague to other emperors since 960. He and his brother Constantine[note 4] were named as co-rulers before their father Romanos II died in 963. The throne went to two generals, Nikephoros Phokas (r. 963–969) then John Tzimiskes (r. 969–976), before Basil became senior emperor. His influential great-uncle Basil Lekapenos was the de facto ruler of the Byzantine Empire until 985.[note 5] Basil II then held power for forty years.\nThe early years of Basil's reign were dominated by civil wars against two powerful generals from the Anatolian aristocracy; first Bardas Skleros and later Bardas Phokas, which ended shortly after Phokas' death and Skleros' submission in 989. Basil then oversaw the stabilization and expansion of the eastern frontier of the Byzantine Empire and the complete subjugation of the First Bulgarian Empire, its foremost European foe, after a prolonged struggle. Although the Byzantine Empire had made a truce with the Fatimid Caliphate in 987–988, Basil led a campaign against the Caliphate that ended with another truce in 1000. He also conducted a campaign against the Khazar Khaganate that gained the Byzantine Empire part of Crimea and a series of successful campaigns against the Kingdom of Georgia.\nDespite near-constant warfare, Basil distinguished himself as an administrator, reducing the power of the great land-owning families who dominated the Empire's administration and military, filling its treasury, and leaving it with its greatest expanse in four centuries. Although his successors were largely incapable rulers, the Empire flourished for decades after Basil's death. One of the most important decisions taken during his reign was to offer the hand of his sister Anna Porphyrogenita to Vladimir I of Kiev in exchange for military support, thus forming the Byzantine military unit known as the Varangian Guard. The marriage of Anna and Vladimir led to the Christianization of the Kievan Rus' and the incorporation of later successor nations of Kievan Rus' within the Byzantine cultural and religious tradition. Basil is seen as a Greek national hero but as a despised figure among Bulgarians.\n"
	},
	{
		"date": "November 1028",
		"name": "Romanos III Argyros",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Romanus_III.jpg/220px-Romanus_III.jpg",
		"history": "Romanos III Argyros, or Romanus III Argyrus (Greek: Ρωμανός Γ΄ Αργυρός, Rōmanos III Argyros; 968 – 11 April 1034), was Byzantine emperor from 15 November 1028 until his death. He was a Byzantine noble and senior official in Constantinople when the dying Constantine VIII forced him to divorce his wife and marry the emperor's daughter Zoë. Upon Constantine's death three days later, Romanos took the throne.\nRomanos has been recorded as a well meaning but ineffective emperor. He disorganised the tax system and undermined the military, personally leading a disastrous military expedition against Aleppo. He fell out with his wife and foiled several attempts on his throne, including two which revolved around his sister-in-law Theodora. He spent large amounts on the construction and repair of churches and monasteries. He died after six years on the throne, allegedly murdered, and was succeeded by his wife's young lover, Michael IV.\n"
	},
	{
		"date": "November 1028",
		"name": "Zoë Porphyrogenita",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Zoe_mosaic_Hagia_Sophia.jpg/220px-Zoe_mosaic_Hagia_Sophia.jpg",
		"history": "Zoë Porphyrogenita (Greek: Ζωή \"life\" Medieval Greek: [zo'i]; c. 978 – 11 June 1050) reigned as Byzantine Empress from 11 November 1028 until her death in 1050. She ruled alongside her three husbands, her adopted son Michael V, and her sister Theodora. Zoë held actual power with Theodora for only two months between April and June 1042.\nZoë was born to Constantine VIII, who was nominal co-emperor to his brother Basil II. Basil died when Zoë was 47, leaving the Byzantine throne entirely to her father. As he had no sons, Constantine hoped to continue the dynasty by marrying off one of his daughters. Zoë, aged 50, was married to Romanos Argyros.\nZoë and her husband took the throne three days later on her father's death. The marriage was troubled and after five years Romanos III was found dead in his bath. His death has been variously attributed to Zoë, her young lover Michael, or both. They were married on the same day as the murder, and he was crowned emperor on the following day. Seven years later, Zoë was persuaded to adopt her dying husband's nephew, also named Michael. Once Michael V became emperor, he promptly exiled Zoë. \nMichael V's action sparked a popular revolt which dethroned him and installed Zoë and Theodora as joint empresses. After a two-month joint reign Zoë married a former lover who was installed as Constantine IX Monomachos, transferring power to him. Exactly eight years later, Zoë died aged 72.\n"
	},
	{
		"date": "April 1034",
		"name": "Michael IV the Paphlagonian",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/3/31/Michael_IV_histamenon_%28reverse%29.jpg",
		"history": "Michael IV the Paphlagonian (Greek: Μιχαὴλ (Δ´) ὁ Παφλαγών, Mikhaēl ho Paphlagōn; 1010 – 10 December 1041) was Byzantine Emperor from 11 April 1034 to his death on 10 December 1041. He was the son of a peasant and worked as a money changer until he was found a job at court by his brother John the Orphanotrophos. He caught the eye of the empress Zoë Porphyrogenita and they began a tempestuous and flagrant affair. Michael and Zoë conspired to murder her husband, Emperor Romanos III Argyros, who was found dying in his bath in 1034. Michael and Zoë were married the same day and Michael was crowned emperor the day after.\nMichael, handsome and energetic, suffered from poor health and entrusted most of the business of government to his brother. He distrusted Zoë and went to lengths to ensure that he did not suffer the same fate as his predecessor. The fortunes of the Empire under Michael's reign were mixed, with his most triumphant moment coming in 1041 when he led the imperial army against Bulgarian rebels. He returned in triumph from this victory, but died a few months later.\n"
	},
	{
		"date": "December 1041",
		"name": "Michael V Kalaphates",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Histamenon_nomisma-Micael_V-sb1776.jpg/220px-Histamenon_nomisma-Micael_V-sb1776.jpg",
		"history": "Michael V (Greek: Μιχαήλ Ε΄, Mikhaēl V; 1015 – 24 August 1042) was Byzantine emperor for four months in 1041–1042. He was the nephew and successor of Michael IV and the adoptive son of his wife Empress Zoe. He was popularly called \"the Caulker\" (Καλαφάτης, Kalaphates) in accordance with his father's original occupation.\n"
	},
	{
		"date": "June 1042",
		"name": "Constantine IX Monomachos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/9/94/Emperor_Constantine_IX.jpg/220px-Emperor_Constantine_IX.jpg",
		"history": "Constantine IX Monomachos, Latinized as Constantine IX Monomachus (Medieval Greek: Κωνσταντῖνος Θ΄ Μονομάχος, romanized: Kōnstantinos IX Monomachos; c. 1000 – 11 January 1055), reigned as Byzantine emperor from 11 June 1042 to 11 January 1055. He had been chosen by the Empress Zoë as a husband and co-emperor in 1042, although he had been exiled for conspiring against her previous husband, Emperor Michael IV the Paphlagonian. They ruled together until Zoë died in 1050.\nDuring Constantine's reign, the Byzantine Empire fought wars against groups which included the Kievan Rus' and the Seljuq Turks. In the year before his death, the split between the Eastern Orthodox and Roman Catholic Churches took place.\n"
	},
	{
		"date": "August 1056",
		"name": "Michael VI Bringas",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/a/a0/Michael_VI_tetarteron_%28reverse%29.jpg",
		"history": "Michael VI Bringas (Greek: Μιχαήλ ΣΤ΄ Βρίγγας, Mikhaēl VI Bringas), called Stratiotikos or Stratioticus (\"the Military One\", \"the Warlike\", or \"the Bellicose\") or Gerontas (\"the Old\"), reigned as Byzantine emperor from 1056 to 1057.\n"
	},
	{
		"date": "June 1057",
		"name": "Isaac I Komnenos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/f/f6/INC-3060-r_%D0%9D%D0%BE%D0%BC%D0%B8%D1%81%D0%BC%D0%B0_%D1%82%D0%B5%D1%82%D0%B0%D1%80%D1%82%D0%B5%D1%80%D0%BE%D0%BD._%D0%98%D1%81%D0%B0%D0%B0%D0%BA_I_%D0%9A%D0%BE%D0%BC%D0%BD%D0%B8%D0%BD._%D0%9E%D0%BA._1057%E2%80%941059_%D0%B3%D0%B3._%28%D1%80%D0%B5%D0%B2%D0%B5%D1%80%D1%81%29.png/220px-INC-3060-r_%D0%9D%D0%BE%D0%BC%D0%B8%D1%81%D0%BC%D0%B0_%D1%82%D0%B5%D1%82%D0%B0%D1%80%D1%82%D0%B5%D1%80%D0%BE%D0%BD._%D0%98%D1%81%D0%B0%D0%B0%D0%BA_I_%D0%9A%D0%BE%D0%BC%D0%BD%D0%B8%D0%BD._%D0%9E%D0%BA._1057%E2%80%941059_%D0%B3%D0%B3._%28%D1%80%D0%B5%D0%B2%D0%B5%D1%80%D1%81%29.png",
		"history": "Isaac I Komnenos or Comnenus (Greek: Ἰσαάϰιος ὁ Κομνη­νός, Isaakios ho Komnēnos; c. 1007 – 1060) was Byzantine Emperor from 1057 to 1059, the first reigning member of the Komnenian dynasty. \nThe son of the general Manuel Erotikos Komnenos, he was orphaned at an early age, and was raised under the care of Emperor Basil II. He made his name as a successful military commander, serving as commander-in-chief of the eastern armies between c. 1042 and 1054. In 1057 he became the head of a conspiracy of the dissatisfied eastern generals against the newly crowned Michael VI Bringas. Proclaimed emperor by his followers on 8 June 1057, he rallied sufficient military forces to defeat the loyalist army at the Battle of Hades. While Isaac was willing to accept a compromise solution by being appointed Michael's heir, a powerful faction in Constantinople, led by the ambitious Patriarch of Constantinople, Michael Keroularios, pressured Michael to abdicate.  After Michael abdicated on 30 August 1057, Isaac was crowned emperor in the Hagia Sophia on 1 September.\nAs emperor, he rewarded his supporters, but also embarked on a series of fiscal measures designed to shore up revenue and eliminate the excesses allowed to flourish under his predecessors. His aim was to fill the treasury and restore the Byzantine army's effectiveness to preserve the empire. The reduction of salaries, harsh tax measures and confiscation of Church properties aroused much opposition, particularly from Keroularios, who had come to think of himself as a king-maker. \nIn November 1058, Keroularios was arrested and exiled, and died before a synod to depose him could be convened. The eastern frontier held firm during his reign, Hungarian raids were resolved by a treaty in 1059, while the restive Pechenegs were subdued by Isaac in person in summer 1059. Shortly after, Isaac fell ill, and on the advice and pressure of Michael Psellos, he abdicated his throne in favour of Constantine X Doukas, retiring to the Stoudion monastery where he died later in 1060.\n"
	},
	{
		"date": "November 1059",
		"name": "Constantine X Doukas",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/7/71/Costantino_X_-_histamenon_-_Sear_1847v_%28reverse%29.jpg",
		"history": "Constantine X Doukas or Dukas, Latinised as Ducas (Greek: Κωνσταντῖνος Ι΄ Δούκας, Kōnstantinos X Doukas, 1006 – 22 May 1067) was Byzantine Emperor from 1059 to 1067. He was the founder and first ruling member of the short-lived Doukid dynasty. During his reign, the Normans took over much of the remaining Byzantine territories in Italy while in the Balkans the Hungarians occupied Belgrade. He also suffered defeats against the Seljuk sultan Alp Arslan.\n"
	},
	{
		"date": "May 1071",
		"name": "Michael VII Doukas",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/2/27/NomismaMikaelVIIDoukas.jpg/220px-NomismaMikaelVIIDoukas.jpg",
		"history": "Michael VII Doukas or Dukas/Ducas (Greek: Μιχαήλ Ζ΄ Δούκας, Mikhaēl VII Doukas), nicknamed Parapinakes (Greek: Παραπινάκης, lit. \"minus a quarter\", with reference to the devaluation of the Byzantine currency under his rule), was Byzantine emperor from 1071 to 1078.\n"
	},
	{
		"date": "January 1068",
		"name": "Romanos IV Diogenes",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/43/Romanos_et_Eudoxie.JPG/220px-Romanos_et_Eudoxie.JPG",
		"history": "Romanos IV Diogenes (Greek: Ρωμανός Δ΄ Διογένης, Rōmanós IV Diogénēs), also known as Romanus IV, was a member of the Byzantine military aristocracy who, after his marriage to the widowed empress Eudokia Makrembolitissa, was crowned Byzantine emperor and reigned from 1068 to 1071. During his reign he was determined to halt the decline of the Byzantine military and to stop Turkish incursions into the Byzantine Empire, but in 1071 he was captured and his army routed at the Battle of Manzikert. While still captive he was overthrown in a palace coup, and when released he was quickly defeated and detained by members of the Doukas family. In 1072, he was blinded and sent to a monastery, where he died of his wounds.\n"
	},
	{
		"date": "January 1078",
		"name": "Nikephoros III Botaneiates",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Meister_der_Predigtsammlung_des_Heiligen_Johannes_Chrysostomus_001.jpg/220px-Meister_der_Predigtsammlung_des_Heiligen_Johannes_Chrysostomus_001.jpg",
		"history": "Nikephoros III Botaneiates, Latinized as Nicephorus III Botaniates (Greek: Νικηφόρος Βοτανειάτης, c. 1002 – 10 December 1081), was Byzantine emperor from 1078 to 1081. He was born in c. 1002, and became a general during the reign of Constantine X. He backed Isaac I Komnenos in his successful attempt to seize the throne, serving a prominent role during the Battle of Petroe. In 1078, he revolted against Emperor Michael VII, claiming the throne for himself, with the support of the Seljuk Turks. Michael VII, faced also with the revolt of Nikephoros Bryennios, chose to abdicate to Nikephoros III. \nAfter being crowned, Nikephoros sought to marry Eudokia Makrembolitissa, and when he was unable to do this, married Maria of Alania. Nikephoros was faced with numerous revolts, including those of several Armenian princes, and two Paulician leaders. Nikephoros became increasingly dependent upon Alexios I Komnenos, who he was forced to abdicate to in 1081, after Robert Guiscard invaded on the pretext of ensuring the rights of Constantine Doukas, the son of Maria of Alania who Nikephoros refused to make junior emperor. After being deposed, he retired to the Church of St. Mary Peribleptos, where he died the same year.\n"
	},
	{
		"date": "April 1081",
		"name": "Alexios I Komnenos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Alexios_I_Komnenos.jpg/220px-Alexios_I_Komnenos.jpg",
		"history": "Alexios I Komnenos (Greek: Ἀλέξιος Κομνηνός, c. 1048 – 15 August 1118), Latinized Alexius I Comnenus, was Byzantine emperor from 1081 to 1118. Although he was not the founder of the Komnenian dynasty, it was during his reign that the Komnenos family came to full power. Inheriting a collapsing empire and faced with constant warfare during his reign against both the Seljuq Turks in Asia Minor and the Normans in the western Balkans, Alexios was able to curb the Byzantine decline and begin the military, financial, and territorial recovery known as the Komnenian restoration. The basis for this recovery were various reforms initiated by Alexios. His appeals to Western Europe for help against the Turks were also the catalyst that likely contributed to the convoking of the Crusades.\n"
	},
	{
		"date": "August 1118",
		"name": "John II Komnenos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Jean_II_Comnene.jpg/220px-Jean_II_Comnene.jpg",
		"history": "John II Komnenos or Comnenus (Greek: Ίωάννης Βʹ Κομνηνός, Iōannēs II Komnēnos; 13 September 1087 – 8 April 1143) was Byzantine emperor from 1118 to 1143. Also known as \"John the Beautiful\" or \"John the Good\" (Kaloïōannēs), he was the eldest son of Emperor Alexios I Komnenos and Irene Doukaina and the second emperor to rule during the Komnenian restoration of the Byzantine Empire. John was a pious and dedicated monarch who was determined to undo the damage his empire had suffered following the battle of Manzikert, half a century earlier.\nJohn has been assessed as the greatest of the Komnenian emperors.[1] In the course of his twenty-five year reign, John made alliances with the Holy Roman Empire in the west, decisively defeated the Pechenegs, Hungarians and Serbs in the Balkans, and personally led numerous campaigns against the Turks in Asia Minor. John's campaigns fundamentally changed the balance of power in the east, forcing the Turks onto the defensive and restoring to the Byzantines many towns, fortresses and cities right across the Anatolian peninsula. In the southeast, John extended Byzantine control from the Maeander in the west all the way to Cilicia and Tarsus in the east. In an effort to demonstrate the Byzantine ideal of the emperor's role as the leader of the Christian world, John marched into Muslim Syria at the head of the combined forces of Byzantium and the Crusader states; yet despite the great vigour with which he pressed the campaign, John's hopes were disappointed by the evasiveness of his Crusader allies and their reluctance to fight alongside his forces.\nUnder John, the empire's population recovered to about 10 million people.[2] The quarter-century of John II's reign is less well recorded by contemporary or near-contemporary writers than the reigns of either his father, Alexios I, or his son, Manuel I. In particular little is known of the history of John's domestic rule or policies.[a]"
	},
	{
		"date": "April 1143",
		"name": "Manuel I Komnenos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/a/af/Manuel_I_Comnenus.jpg/230px-Manuel_I_Comnenus.jpg",
		"history": "Manuel I Komnenos (or Comnenus; Greek: Μανουήλ Α' Κομνηνός, Manouēl I Komnēnos; 28 November 1118 – 24 September 1180) was a Byzantine Emperor of the 12th century who reigned over a crucial turning point in the history of Byzantium and the Mediterranean. His reign saw the last flowering of the Komnenian restoration, during which the Byzantine Empire had seen a resurgence of its military and economic power, and had enjoyed a cultural revival.\nEager to restore his empire to its past glories as the superpower of the Mediterranean world, Manuel pursued an energetic and ambitious foreign policy. In the process he made alliances with the Pope and the resurgent West. He invaded the Norman Kingdom of Sicily, although unsuccessfully, being the last Eastern Roman Emperor to attempt reconquests in the western Mediterranean. The passage of the potentially dangerous Second Crusade through his empire was adroitly managed. Manuel established a Byzantine protectorate over the Crusader states of Outremer. Facing Muslim advances in the Holy Land, he made common cause with the Kingdom of Jerusalem and participated in a combined invasion of Fatimid Egypt. Manuel reshaped the political maps of the Balkans and the eastern Mediterranean, placing the kingdoms of Hungary and Outremer under Byzantine hegemony and campaigning aggressively against his neighbours both in the west and in the east.\nHowever, towards the end of his reign Manuel's achievements in the east were compromised by a serious defeat at Myriokephalon, which in large part resulted from his arrogance in attacking a well-defended Seljuk position. Although the Byzantines recovered and Manuel concluded an advantageous peace with Sultan Kilij Arslan II, Myriokephalon proved to be the final, unsuccessful effort by the empire to recover the interior of Anatolia from the Turks.\nCalled ho Megas (ὁ Μέγας, translated as \"the Great\") by the Greeks, Manuel is known to have inspired intense loyalty in those who served him. He also appears as the hero of a history written by his secretary, John Kinnamos, in which every virtue is attributed to him. Manuel, who was influenced by his contact with western Crusaders, enjoyed the reputation of \"the most blessed emperor of Constantinople\" in parts of the Latin world as well.[1] Modern historians, however, have been less enthusiastic about him. Some of them assert that the great power he wielded was not his own personal achievement, but that of the dynasty he represented; they also argue that, since Byzantine imperial power declined catastrophically after Manuel's death, it is only natural to look for the causes of this decline in his reign.[2]"
	},
	{
		"date": "September 1180",
		"name": "Alexios II Komnenos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/2/23/Alexios_II_-_komnenos.jpg/220px-Alexios_II_-_komnenos.jpg",
		"history": "Alexios II Komnenos or Alexius II Comnenus (Medieval Greek: Αλέξιος Β′ Κομνηνός, romanized: Alexios II Komnēnos) (10 September 1169 – October 1183) was Byzantine emperor from 1180 to 1183. He was the son of Emperor Manuel I Komnenos and Maria, daughter of Raymond of Poitiers, prince of Antioch.[1] He was the long-awaited male heir and was named Alexius as a fulfilment of the AIMA prophecy.\n"
	},
	{
		"date": "September 1183",
		"name": "Andronikos I Komnenos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/1/17/ByzantineBillonTrachy.jpg/220px-ByzantineBillonTrachy.jpg",
		"history": "Andronikos I Komnenos (Greek: Ανδρόνικος Αʹ Κομνηνός, Andrónikos I Komnēnós; c. 1118 – 12 September 1185), usually Latinized as Andronicus I Comnenus, was Byzantine Emperor from 1183 to 1185. He was the son of Isaac Komnenos and the grandson of the emperor Alexios I.\n"
	},
	{
		"date": "September 1185",
		"name": "Isaac II Angelos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/a/a7/Isaac_II_Angelos.jpg",
		"history": "Isaac II Angelos (Greek: Ἰσαάκιος Β’ Ἄγγελος, Isaakios II Angelos; September 1156 – January 1204) was Byzantine Emperor from 1185 to 1195, and again from 1203 to 1204.\nHis father Andronikos Doukas Angelos was a military leader in Asia Minor (c. 1122 – aft. 1185) who married Euphrosyne Kastamonitissa (c. 1125 – aft. 1195). Andronikos Doukas Angelos was the son of Constantine Angelos and Theodora Komnene (b. 15 January 1096/1097), the youngest daughter of Emperor Alexios I Komnenos and Irene Doukaina. Thus Isaac was a member of the extended imperial clan of the Komnenoi.\n"
	},
	{
		"date": "April 1195",
		"name": "Alexios III Angelos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Alexios_III.jpg/220px-Alexios_III.jpg",
		"history": "Alexios III Angelos (Medieval Greek: Ἀλέξιος Γ′ Ἄγγελος) (c. 1153 – 1211) was Byzantine Emperor from March 1195 to July 17/18, 1203.[1]  A member of the extended imperial family, Alexios came to throne after deposing, blinding, and imprisoning his younger brother Isaac II Angelos.  The most significant event of his reign was the attack of the Fourth Crusade on Constantinople in 1203, on behalf of Alexios IV Angelos.  Alexios III took over the defense of the city, which he mismanaged, then fled the city at night with one of his three daughters. From Adrianople, and then Mosynopolis, he unsuccessfully attempted to rally his supporters, only to end up a captive of Marquis Boniface of Montferrat. He was ransomed, sent to Asia Minor where he plotted against his son-in-law Theodore Laskaris, but was eventually arrested and spent his last days confined to the Monastery of Hyakinthos in Nicaea, where he died.\n"
	},
	{
		"date": "August 1203",
		"name": "Alexios IV Angelos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Alexius4.jpg/200px-Alexius4.jpg",
		"history": "Alexios IV Angelos or Alexius IV Angelus (Greek: Αλέξιος Δ' Άγγελος) (c. 1182 – 8 February 1204) was Byzantine Emperor from August 1203 to January 1204. He was the son of Emperor Isaac II Angelus and his first wife, an unknown Palaiologina, who became a nun with the name Irene. His paternal uncle was Emperor Alexius III Angelus.\n"
	},
	{
		"date": "1204",
		"name": "Alexios V Doukas",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Alexius_V.JPG/220px-Alexius_V.JPG",
		"history": "Alexios V Doukas (Greek: Ἀλέξιος Εʹ Δούκας; d. December 1204), in Latinised spelling Alexius V Ducas, was Byzantine emperor from 5 February to 12 April 1204, during the second and final siege of Constantinople by the participants of the Fourth Crusade. His family name was Doukas, but he was also known by the nickname Mourtzouphlos or Murtzuphlus (Μούρτζουφλος), referring to either bushy, overhanging eyebrows or a sullen, gloomy character.[1] He achieved power through a palace coup, killing his predecessors in the process. Though he made vigorous attempts to defend Constantinople from the crusader army, his military efforts proved ineffective. His actions won the support of the mass of the populace, but he alienated the elite of the city. Following the fall, sack, and occupation of the city, Alexios V was blinded by another ex-emperor and later executed by the new Latin regime. He was the last Byzantine emperor to rule in Constantinople until the Byzantine recapture of Constantinople in 1261.\n"
	},
	{
		"date": "1205",
		"name": "Theodore I Laskaris",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Theodore_I_Laskaris_miniature.jpg/220px-Theodore_I_Laskaris_miniature.jpg",
		"history": "Theodoros I Komnenos Laskaris (Greek: Θεόδωρος Α' Λάσκαρις, Theodōros I Laskaris; c. 1174/5 – 1221/August 1222) was the first Emperor of Nicaea (reigned 1204/05–1221/22).\n"
	},
	{
		"date": "December 1222",
		"name": "John III Doukas Vatatzes",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/9/92/John_III_Doukas_Vatatzes.jpg/220px-John_III_Doukas_Vatatzes.jpg",
		"history": "John III Doukas Vatatzes, Latinized as Ducas Vatatzes (Greek: Ιωάννης Γ΄ Δούκας Βατάτζης, Iōannēs III Doukas Vatatzēs, c. 1193, Didymoteicho – 3 November 1254, Nymphaion), was Emperor of Nicaea from 1222 to 1254. He was succeeded by his son, known as Theodore II Laskaris.\n"
	},
	{
		"date": "1254",
		"name": "Theodore II Doukas Laskaris",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/89/Theodore_II_Laskaris_miniature.jpg/220px-Theodore_II_Laskaris_miniature.jpg",
		"history": "Theodore II Doukas Laskaris or Ducas Lascaris (Greek: Θεόδωρος Β΄ Δούκας Λάσκαρις, Theodōros II Doukas Laskaris; 1221/1222 – August 18, 1258) was Emperor of Nicaea from 1254 to 1258.\n"
	},
	{
		"date": "August 1258",
		"name": "John IV Doukas Laskaris",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/1/1e/John_IV_Laskaris_miniature.jpg/220px-John_IV_Laskaris_miniature.jpg",
		"history": "John IV Doukas Laskaris (or Ducas Lascaris) (Greek: Ἰωάννης Δ΄ Δούκας Λάσκαρις, romanized: Iōannēs IV Doukas Laskaris) (December 25, 1250 – c. 1305) was emperor of Nicaea from August 18, 1258, to December 25, 1261. This empire was one of the Greek states formed from the remaining fragments of the Byzantine Empire, after the capture of Constantinople by Roman Catholics during the Fourth Crusade in 1204.\n"
	},
	{
		"date": "August 1261",
		"name": "Michael VIII Palaiologos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Michael_VIII_Palaiologos_%28head%29.jpg/220px-Michael_VIII_Palaiologos_%28head%29.jpg",
		"history": "Michael VIII Palaiologos or Palaeologus (Greek: Μιχαὴλ Η΄ Παλαιολόγος, romanized: Mikhaēl VIII Palaiologos; 1223 – 11 December 1282) reigned as the co-emperor of the Empire of Nicaea from 1259 to 1261, and as Byzantine Emperor from 1261 until his death. Michael VIII was the founder of the Palaiologan dynasty that would rule the Byzantine Empire until the Fall of Constantinople in 1453. He recovered Constantinople from the Latin Empire in 1261 and transformed the Empire of Nicaea into a restored Byzantine Empire.[2]His reign would see considerable recovery of Byzantine power, including the enlargement of the Byzantine army and navy. It would also include the reconstruction of the city of Constantinople, and the increase of its population.[3] He reestablished the University of Constantinople, which would lead to what is regarded as the Paliologian Renaissance during the 14th and 15th centuries.[3] It would also be at this time that the focus of the Byzantine military shifted to the Balkans, against the Bulgarians, leaving the Anatolian frontier neglected.[3] His successors would also not fix this issue, and the Byzantine civil war made this situation much worse, draining the empire's strength, economy, and resources. These internal conflicts lead to the permanent losses of important provinces such as Epirus to the Serbian Empire. Eventually, the consequences of these conflicts would allow for the Anatolian beyliks to rise in power, most notably the one of Osman, later called the Ottoman Empire. His successors would conquer more parts of the empire, until finally the city of Constantinople itself in 1453, under the leadership of Mehmed II.\n"
	},
	{
		"date": "December 1282",
		"name": "Andronikos II Palaiologos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/0/00/Andronikos_II_Palaiologos_%28head%29.jpg/220px-Andronikos_II_Palaiologos_%28head%29.jpg",
		"history": "Andronikos II Palaiologos (Medieval Greek: Ἀνδρόνικος Β′ Παλαιολόγος; 25 March 1259 – 13 February 1332), usually Latinized as Andronicus II Palaeologus, reigned as Byzantine Emperor from 1282 to 1328.[1] Andronikos' reign was marked by the beginning of the decline of the Byzantine Empire. During his reign, the Turks conquered most of the Western Anatolian territories of the Empire and, during the last years of his reign, he also had to fight his grandson Andronikos in the First Palaiologan Civil War. The civil war ended in Andronikos II's forced abdication in 1328 after which he retired to a monastery.\n"
	},
	{
		"date": "1294 or 1295",
		"name": "Michael IX Palaiologos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Michael_IX_Palaiologos.jpg/220px-Michael_IX_Palaiologos.jpg",
		"history": "Michael IX Palaiologos or Palaeologus (Greek: Μιχαήλ Θ΄ Παλαιολόγος, Mikhaēl IX Palaiologos), (17 April 1277 – 12 October 1320, Thessalonica, reigned as Byzantine co-emperor with full imperial style 1294/1295–1320.  Michael IX was the eldest son of Andronikos II Palaiologos and Anna of Hungary,[1] daughter of Stephen V of Hungary.\n"
	},
	{
		"date": "May 1328",
		"name": "Andronikos III Palaiologos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/d/df/Andronikos_III_Palaiologos.jpg/220px-Andronikos_III_Palaiologos.jpg",
		"history": "Andronikos III Palaiologos (Medieval Greek: Ἀνδρόνικος Γ′ Παλαιολόγος; 25 March 1297 – 15 June 1341), commonly Latinized as Andronicus III Palaeologus, was the Byzantine emperor from 1328 to 1341.[1] Born Andronikos Doukas Angelos Komnenos Palaiologos (Ἀνδρόνικος Δούκας Ἄγγελος Κομνηνός Παλαιολόγος), he was the son of Michael IX Palaiologos and Rita of Armenia. He was proclaimed co-emperor in his youth, before 1313, and in April 1321 he rebelled in opposition to his grandfather, Andronikos II Palaiologos. He was formally crowned co-emperor in February 1325, before ousting his grandfather outright and becoming sole emperor on 24 May 1328.\nHis reign included the last failed attempts to hold back the Ottoman Turks in Bithynia and the defeat at Rusokastro against the Bulgarians, but also the successful recovery of Chios, Lesbos, Phocaea, Thessaly, and Epirus.[1] His early death left a power vacuum that resulted in the disastrous civil war between his Empress-dowager, Anna of Savoy, and his closest friend and supporter, John VI Kantakouzenos.\n"
	},
	{
		"date": "June 1341",
		"name": "John V Palaiologos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/a/af/John_V_Palaiologos.jpg/150px-John_V_Palaiologos.jpg",
		"history": "John V Palaiologos or Palaeologus (Greek: Ίωάννης Ε' Παλαιολόγος, Iōannēs V Palaiologos; 18 June 1332 – 16 February 1391) was a Byzantine emperor, who succeeded his father in 1341 at the age of eight.\n"
	},
	{
		"date": "March 1347",
		"name": "John VI Kantakouzenos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/2/22/John_VI_Kantakouzenos.jpg/200px-John_VI_Kantakouzenos.jpg",
		"history": "John VI Kantakouzenos, Cantacuzenus, or Cantacuzene[1] (Greek: Ἰωάννης ΣΤʹ Καντακουζηνός, Iōannēs ST′ Kantakouzēnos; Latin: Johannes Cantacuzenus;[2] c. 1292 – 15 June 1383[3]) was a Greek nobleman, statesman, and general. He served as Grand Domestic under Andronikos III Palaiologos and regent for John V Palaiologos before reigning as Byzantine emperor in his own right from 1347 to 1354. Usurped by his former ward, he retired to a monastery under the name Joasaph Christodoulos and spent the remainder of his life as a monk and historian.\n\n"
	},
	{
		"date": "August 1376",
		"name": "Andronikos IV Palaiologos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Andronikos_IV_Palaiologos.jpg/220px-Andronikos_IV_Palaiologos.jpg",
		"history": "Andronikos IV Palaiologos (Greek: Ἀνδρόνικος Δ' Παλαιολόγος; 11 April 1348 – 25/28 June 1385), often Latinized as Andronicus IV Palaeologus, was the eldest son of Emperor John V Palaiologos. Appointed co-emperor since 1352, he had a troubled relationship with his father: he launched a failed rebellion in 1373, usurped the throne in 1376–1379, and remained engaged in a bitter struggle with John V until his death in 1385. This civil war depleted Byzantium's scarce resources and greatly facilitated the Ottoman conquest of the Balkans, most notably through the cession of Gallipoli by Andronikos.\n"
	},
	{
		"date": "April 1390",
		"name": "John VII Palaiologos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/8/85/John_VII_Palaiologos.gif",
		"history": "John VII Palaiologos or Palaeologus (Greek: Ιωάννης Ζ' Παλαιολόγος, Iōannēs Z' Palaiologos; 1370 – 22 September 1408) was Byzantine Emperor for five months in 1390. While he was Emperor, there is evidence showing he used the name Andronikos, after his father, although when he was regent during his uncle's absence in the West, he governed in his birth name.[1]"
	},
	{
		"date": "February 1391",
		"name": "Manuel II Palaiologos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/d/db/Manuel_II_Paleologus.jpg",
		"history": "Manuel II Palaiologos or Palaeologus (Greek: Μανουήλ Β΄ Παλαιολόγος, Manouēl II Palaiologos; 27 June 1350 – 21 July 1425) was Byzantine Emperor from 1391 to 1425. Shortly before his death he was tonsured a monk and received the name Matthew. His wife Helena Dragaš saw to it that their sons, John VIII Palaiologos and Constantine XI Palaiologos, become emperors. Manuel is commemorated on July 21.[1]"
	},
	{
		"date": "1425",
		"name": "John VIII Palaiologos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/2/24/Palaio.jpg/220px-Palaio.jpg",
		"history": "John VIII Palaiologos or Palaeologus (Greek: Ἰωάννης Παλαιολόγος, romanized: Iōannēs Palaiologos; 18 December 1392 – 31 October 1448) was the penultimate reigning Byzantine Emperor, ruling from 1425 to 1448.\n"
	},
	{
		"date": "January 1449",
		"name": "Constantine XI Palaiologos",
		"portraitLink": "//upload.wikimedia.org/wikipedia/commons/thumb/1/12/Constantine_XI_Palaiologos_miniature.jpg/220px-Constantine_XI_Palaiologos_miniature.jpg",
		"history": "Constantine XI Dragases Palaiologos, Latinized as Palaeologus (Greek: Κωνσταντῖνος ΙΑ' Δραγάσης Παλαιολόγος, Kōnstantinos XI Dragasēs Palaiologos; Serbian: Константин XI Драгаш Палеолог, Konstantin XI Dragaš Paleolog; 8 February 1405 – 29 May 1453) was the last reigning  Roman and Byzantine (Eastern Roman) Emperor, ruling as a member of the Palaiologos dynasty from 1449 to his death in battle at the fall of Constantinople in 1453.\nPreviously serving as regent for his brother John VIII 1437–1439, Constantine succeeded his brother, who died in Constantinople of natural causes in 1448, as Emperor following a short dispute with his younger brother Demetrios. Despite the mounting difficulties of his reign, contemporary sources generally speak respectfully of Constantine. Constantine would rule for just over 4 years, his reign culminating in the Ottoman siege and conquest of Constantinople, the imperial capital, under Sultan Mehmed II. Constantine did what he could to organize the defenses of the city, stockpiling food and repairing the old Theodosian walls, but the reduced domain of the Empire and the poor economy meant that organizing a force large enough for the defense of the city was impossible. Constantine led the defending forces, numbering approximately 7,000, against an Ottoman army numbering around 10 times that and died in the ensuing fighting.\nFollowing his death, he became a legendary figure in Greek folklore as the \"Marble Emperor\" who would awaken and recover the Empire and Constantinople from the Ottomans.[1] His death marked the end of the Roman Empire. It had continued in the East as the Byzantine Empire for 977 years after the fall of the Western Roman Empire in 476. The Empire had begun with the reign of Augustus in 27 BC,[2] 1,479 years prior.\n"
	}
]
